package amit.action.besthindishayari;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.core.app.ActivityCompat;
import androidx.core.content.ContextCompat;

import android.app.ProgressDialog;
import android.content.ClipData;
import android.content.ClipboardManager;
import android.content.ContentValues;
import android.content.Context;
import android.content.DialogInterface;
import android.content.Intent;
import android.content.pm.PackageManager;
import android.graphics.Bitmap;
import android.graphics.Canvas;
import android.net.Uri;
import android.os.Build;
import android.os.Bundle;
import android.provider.MediaStore;
import android.view.View;
import android.view.animation.Animation;
import android.view.animation.AnimationUtils;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.RelativeLayout;
import android.widget.TextView;
import android.widget.Toast;

import com.google.android.gms.tasks.OnCompleteListener;
import com.google.android.gms.tasks.Task;
import com.google.android.material.snackbar.Snackbar;
import com.google.firebase.auth.FirebaseAuth;
import com.google.firebase.auth.FirebaseUser;
import com.google.firebase.database.DataSnapshot;
import com.google.firebase.database.DatabaseError;
import com.google.firebase.database.DatabaseReference;
import com.google.firebase.database.FirebaseDatabase;
import com.google.firebase.database.ValueEventListener;

import java.io.OutputStream;
import java.util.ArrayList;
import java.util.HashMap;

import static android.Manifest.permission.WRITE_EXTERNAL_STORAGE;


public class TopicShayariActivity extends AppCompatActivity {
    private static final int PERMISSION_REQUEST_CODE = 200;
    private FirebaseAuth mAuth;
    private FirebaseDatabase mDatabase;
    private DatabaseReference mRef;
    private StringBuffer topicNameText;
    private String topic, curShayari;
    private int curIndex = 0;
    private boolean isCurShayariFav = false;
    private String uniqueText = "";
    private TextView shayariText, watermark;
    private ImageView shayariImage;
    private Button prevButton, nextButton, moreButton, favButton, whatsAppShareButton, copyButton, shareButton;
    private Toolbar toolbar;
    private ProgressDialog mProgress;
    private RelativeLayout relativeLayout;
    private Animation leftAnim, rightAnim;
    private ArrayList<String> dard, alone, attitude, love, dosti, zindagi, funny, bewafa, sad, judai, good_morning, good_night, birthday, mother, father, new_year, intezaar, legend;
    View v;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_topic_shayari);

        mAuth = FirebaseAuth.getInstance();
        mDatabase = FirebaseDatabase.getInstance();
        mProgress = new ProgressDialog(this);

        prevButton = findViewById(R.id.topic_shayari_prev_button);
        nextButton = findViewById(R.id.topic_shayari_next_button);
        favButton = findViewById(R.id.topic_shayari_fav_button);
        moreButton = findViewById(R.id.topic_shayari_more_button);
        shayariImage = findViewById(R.id.topic_shayari_image);
        shayariText = findViewById(R.id.topic_shayari_text);
        whatsAppShareButton = findViewById(R.id.topi_shayari_whatsapp_share);
        copyButton = findViewById(R.id.topic_shayari_copy_text);
        shareButton = findViewById(R.id.topic_shayari_share);
        relativeLayout = findViewById(R.id.topic_relative_layout);
        watermark = findViewById(R.id.topic_shayari_watermark);

        topicNameText = new StringBuffer(getIntent().getStringExtra("topic_name"));
        topic = new String(topicNameText);
        topicNameText.replace(0, 1, Character.toString(topicNameText.charAt(0)).toUpperCase());
        toolbar = findViewById(R.id.topic_shayari_app_bar);

        leftAnim = AnimationUtils.loadAnimation(this, R.anim.left_anim);
        rightAnim = AnimationUtils.loadAnimation(this, R.anim.right_anim);
        shayariImage.setAnimation(leftAnim);

        setSupportActionBar(toolbar);
        getSupportActionBar().setTitle(topicNameText + " Shayari");
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setDisplayShowHomeEnabled(true);

        shayariImage.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                goToEditActivity();
            }
        });


        legend = new ArrayList<>();
        legend.add("Abhi AA raha hai");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");
        legend.add("");

        alone = new ArrayList<>();
        //2nd page.

        alone.add("कितनी अजीब है इस शहर की तन्हाई भी,\n" +
                "हजारों लोग हैं मगर कोई उस जैसा नहीं है।");
        alone.add("एक तेरे ना होने से बदल जाता है सब कुछ\n" +
                "कल धूप भी दीवार पे पूरी नहीं उतरी।");
        alone.add("जगमगाते शहर की रानाइयों में क्या न था,\n" +
                "ढूँढ़ने निकला था जिसको बस वही चेहरा न था,\n" +
                "हम वही, तुम भी वही, मौसम वही, मंज़र वही,\n" +
                "फ़ासले बढ़ जायेंगे इतने मैंने कभी सोचा न था।");
        alone.add("ये भी शायद ज़िंदगी की इक अदा है दोस्तों,\n" +
                "जिसको कोई मिल गया वो और तन्हा हो गया।");
        alone.add("सहारा लेना ही पड़ता है मुझको दरिया का,\n" +
                "मैं एक कतरा हूँ तनहा तो बह नहीं सकता।");
        alone.add("वो हर बार मुझे छोड़ के चले जाते हैं तन्हा,\n" +
                "मैं मज़बूत बहुत हूँ लेकिन कोई पत्थर तो नहीं हूँ।");
        alone.add("कुछ कर गुजरने की चाह में कहाँ-कहाँ से गुजरे,\n" +
                "अकेले ही नजर आये हम जहाँ-जहाँ से गुजरे।");
        alone.add("जब से देखा है चाँद को तन्हा,\n" +
                "तुम से भी कोई शिकायत ना रही।");
        alone.add("मैं हूँ दिल है तन्हाई है,\n" +
                "तुम भी जो होते तो अच्छा होता।");
        alone.add("बहुत सोचा बहुत समझा\n" +
                "बहुत ही देर तक परखा,\n" +
                "कि तन्हा हो के जी लेना\n" +
                "मोहब्बत से तो बेहतर है।");
        alone.add("कहने लगी है अब तो मेरी तन्हाई भी मुझसे,\n" +
                "मुझसे कर लो मोहब्बत मैं तो बेवफा भी नहीं।");
        alone.add("एहतियातन देखता चल अपने साए की तरफ,\n" +
                "इस तरह शायद तुझे एहसास-ए-तन्हाई न हो।");
        alone.add("कुदरत के इन हसीन नजारों का हम क्या करें,\n" +
                "तुम साथ नहीं तो इन चाँद सितारों का क्या करें।");
        alone.add("कितना भी दुनिया के लिए हँस के जी लें हम,\n" +
                "रुला देती है फिर भी किसी की कमी कभी-कभी।");
        alone.add("कभी सोचा न था तन्हाइयों का दर्द यूँ होगा,\n" +
                "मेरे दुश्मन ही मेरा हाल मुझसे पूछते हैं।");
        alone.add("देख कर चेहरा पलट देते हैं अब वो आइना,\n" +
                "मौसम-ए-फुरकत उन्हें सूरत कोई भाती नहीं।");
        alone.add("क्या करेंगे महफिलों में हम बता,\n" +
                "मेरा दिल रहता है काफिलों में अकेला।");
        alone.add("तन्हाई रही साथ ता-जिंदगी मेरे,\n" +
                "शिकवा नहीं कि कोई साथ न रहा।");
        alone.add("उसे पाना उसे खोना उसी के हिज्र में रोना,\n" +
                "यही गर इश्क है तो हम तन्हा ही अच्छे हैं।");
        alone.add("ख्वाब बोये थे और अकेलापन काटा है,\n" +
                "इस मोहब्बत में यारों बहुत घाटा है।");
        alone.add("कितनी फ़िक्र है कुदरत को मेरी तन्हाई की,\n" +
                "जागते रहते हैं रात भर सितारे मेरे लिए।");
        alone.add("मेरी तन्हाइयां करती हैं \u200Bजिन्हें याद सदा,\n" +
                "उन को भी मेरी ज़रुरत हो ज़रूरी तो नहीं।");
        alone.add("वो जोश-ए-तन्हाई शब-ए-ग़म,\n" +
                "वो हर तरफ बेकसी का आलम,\n" +
                "कटी है आँखों में रात सारी,\n" +
                "तड़प तड़प कर सहर हुयी।");
        alone.add("मेरा और उस चाँद का मुकद्दर एक जैसा है,\n" +
                "वो तारों में तन्हा है और मैं हजारों में तन्हा।");
        alone.add("एक पुराना मौसम लौटा याद भरी पुरवाई भी,\n" +
                "ऐसा तो कम ही होता है वो भी हो तन्हाई भी।");
        alone.add("ऐ शम्मा तुझपे ये रात भारी है जिस तरह,\n" +
                "हमने तमाम उम्र गुजारी है उस तरह।");
        alone.add("तुम्हारे बगैर ये वक़्त ये दिन और ये रात,\n" +
                "गुजर तो जाते हैं मगर गुजारे नहीं जाते।");
        alone.add("उसके दिल में थोड़ी सी जगह माँगी थी\n" +
                "मुसाफिरों की तरह,\n" +
                "उसने तन्हाईयों का एक शहर\n" +
                "मेरे नाम कर दिया।");
        alone.add("जब महफ़िल में भी तन्हाई पास हो,\n" +
                "रोशनी में भी अँधेरे का एहसास हो,\n" +
                "तब किसी खास की याद में मुस्कुरा दो,\n" +
                "शायद वो भी आपके इंतजार में उदास हो।");
        alone.add("हम अंजुमन में सबकी तरफ देखते रहे,\n" +
                "अपनी तरह से कोई हमें अकेला नहीं मिला।");
        alone.add("वो भी बहुत अकेला है शायद मेरी तरह,\n" +
                "उस को भी कोई चाहने वाला नहीं मिला।");
        alone.add("मेरी यादें मेरा चेहरा मेरी बातें रुलायेंगी,\n" +
                "हिज़्र के दौर में गुज़री मुलाकातें रुलायेंगी,\n" +
                "दिनों को तो चलो तुम काट भी लोगे फसानों में,\n" +
                "जहाँ तन्हा मिलोगे तुम तुम्हें रातें रुलायेंगी।");
        alone.add("क्या लाजवाब था तेरा छोड़ के जाना,\n" +
                "भरी भरी आँखों से मुस्कुराये थे हम,\n" +
                "अब तो सिर्फ मैं हूँ और तेरी यादें हैं,\n" +
                "गुजर रहे हैं यूँ ही तन्हाई के मौसम।");
        alone.add("कैफ में डूबा हुआ हूँ आलम-ए-तन्हाई है,\n" +
                "फिर तेरी याद दबे पाँव चली आई है,\n" +
                "शब-ए-तारीक पे छाई हुयी रानाई है,\n" +
                "यह तेरी ज़ुल्फ़ के साए हैं के परछाई है,\n" +
                "तेरे दीवाने को इतना भी अब होश नहीं,\n" +
                "ये तेरा आगोश है या गौसा-ए-तन्हाई है।");
        alone.add("Zindagi Ke Zehar Ko Yu Has Ke Pi Rahe Hai,\n" +
                "Tere Pyar Bina Yu Hi Zindagi Jee Rahe Hai,\n" +
                "Akelepan Se Toh Ab Darr Nahi Lagta Hamein,\n" +
                "Tere Jaane Ke Baad Yu Hi Tanha Jee Rahe Hai.");
        alone.add("ना जाने क्यूँ खुद को अकेला सा पाया है,\n" +
                "हर एक रिश्ते में खुद को गँवाया है।\n" +
                "शायद कोई तो कमी है मेरे वजूद में,\n" +
                "तभी हर किसी ने हमें यूँ ही ठुकराया है।");
        alone.add("कभी पहलू में आओ तो बताएँगे तुम्हें,\n" +
                "हाल-ए-दिल अपना तमाम सुनाएँगे तुम्हें,\n" +
                "काटी हैं अकेले कैसे हमने तन्हाई की रातें,\n" +
                "हर उस रात की तड़प दिखाएँगे तुम्हें।");
        alone.add("सौ बार चमन महका सौ बार बहार आई,\n" +
                "दुनिया की वही रौनक दिल की वही तन्हाई।");
        alone.add("तेरे जल्वों ने मुझे घेर लिया है ऐ दोस्त,\n" +
                "अब तो तन्हाई के लम्हे भी हसीं लगते हैं।");
        System.out.println("Alone " + alone.size());


        dard = new ArrayList<>();
        dard.add("भीड़ में भी तन्हा रहना मुझको सिखा दिया,\n" +
                "तेरी मोहब्बत ने दुनिया को झूठा कहना सिखा दिया,\n" +
                "किसी दर्द या ख़ुशी का एहसास नहीं है अब तो,\n" +
                "सब कुछ ज़िन्दगी ने चुप-चाप सहना सिखा दिया।");
        dard.add("अब बस भी कर ज़ालिम, कुछ तो रहम खा मुझ पर,\n" +
                "चली जा मेरी नज़र से दूर कहीं मैं शायर ना बन जाऊं।");
        dard.add("एक बात सिखाई है... तजुर्वे ने हमें,\n" +
                "एक नया दर्द ही पुराने दर्द की दवा है।");
        dard.add("ज़माने में किसी पर ऐतबार मत करना,\n" +
                "किसी की चाहत में दिल बेकरार मत करो,\n" +
                "या तो हौंसला रखो दर्द-ए-दिल सहने का,\n" +
                "या फिर किसी से इश्क मत करो।");
        dard.add("तेरी मोहब्बत में हम बैठें हैं चोट खाए,\n" +
                "जिसका हिसाब न हो सके उतने दर्द हमने पाये,\n" +
                "फिर भी तेरे प्यार की कसम खाके कहता हूँ,\n" +
                "हमारे लब पर तेरे लिये सिर्फ और सिर्फ दुआ आये।");
        dard.add("जान गया वो हमें दर्द में भी मुस्कुराने की आदत है,\n" +
                "इसलिए वो रोज़ नया दुःख देता है मेरी ख़ुशी के लिए।");
        dard.add("इलाजे-दर्दे-दिल तुमसे मेरे मसीहा हो नहीं सकता,\n" +
                "तुम अच्छा कर नहीं सकते मैं अच्छा हो नहीं सकता।");
        dard.add("इश्क करने वालों का यही हश्र होता है,\n" +
                "दर्द-ए-दिल होता है, रह रह के सीने में,\n" +
                "बंद होंठ कुछ ना कुछ गुनगुनाते ही रहते हैं,\n" +
                "खामोश निगाहों का भी गहरा असर होता है।");
        dard.add("हर ख़ुशी के पहलू हाथों से छूट गए,\n" +
                "अब तो खुद के साये भी हमसे रूठ गए,\n" +
                "हालात हैं अब ऐसे ज़िंदगी में हमारी,\n" +
                "प्यार की राहों में हम खुद ही टूट गए।");
        dard.add("हवा से लिपटी हुयी सिसकियों से लगता है,\n" +
                "मेरी कहानी फिर किसी आशिक ने दोहराई है।");
        dard.add("लबो पर जब किसी के दर्द का अफ़साना आता है,\n" +
                "हमें रह-रह कर अपना दिल-ए-दीवाना आता है।");
        dard.add("वक़्त हर ज़ख़्म का मरहम तो नहीं बन सकता,\n" +
                "दर्द कुछ ऐसे होते हैं, ता-उम्र रुलाने वाले।");
        dard.add("हर ज़ख़्म किसी ठोकर की मेहरबानी है,\n" +
                "मेरी ज़िंदगी की बस यही एक कहानी है,\n" +
                "मिटा देते तेरे दिए हर दर्द को सीने से,\n" +
                "पर ये दर्द ही तो उसकी आखिरी निशानी है।");
        dard.add("यह ग़ज़लों की दुनिया भी बड़ी अजीब है,\n" +
                "यहाँ आँसुओं के भी जाम बनाये जाते हैं,\n" +
                "कह भी दे अगर दर्द-ए-दिल की दास्तान,\n" +
                "फिर भी वाह-वाह ही पुकारा जाता है।");
        dard.add("मेरे दिल के दर्द को किसने देखा है,\n" +
                "मुझे बस मेरे खुदा ने तड़पते देखा है,\n" +
                "हम तन्हाई में बैठे रोते हैं,\n" +
                "लोगों ने हमे महफ़िल में हँसते देखा है।");
        dard.add("इसे इत्तेफाक समझो या दर्द भरी हकीकत,\n" +
                "आँख जब भी नम हुई वजह कोई अपना ही था।");
        dard.add("गुलशन की बहारों पे सर-ए-शाम लिखा है,\n" +
                "फिर उस ने किताबों पे मेरा नाम लिखा है,\n" +
                "ये दर्द इसी तरह मेरी दुनिया में रहेगा,\n" +
                "कुछ सोच के उस ने मेरा अंजाम लिखा है।");
        dard.add("नसीहत अच्छी देती है दुनिया,\n" +
                "अगर दर्द किसी ग़ैर का हो।");
        dard.add("खामोशियाँ कर देतीं बयान तो अलग बात है,\n" +
                "कुछ दर्द हैं जो लफ़्ज़ों में उतारे नहीं जाते।");
        dard.add("आँखों में उमड़ आता है बादल बन कर,\n" +
                "दर्द एहसास को बंजर नहीं रहने देता।");
        dard.add("रोज़ पिलाता हूँ एक ज़हर का प्याला उसे,\n" +
                "एक दर्द जो दिल में है मरता ही नहीं है।");
        dard.add("दर्द मोहब्बत का ऐ दोस्त बहुत खूब होगा,\n" +
                "न चुभेगा.. न दिखेगा.. बस महसूस होगा।");
        dard.add("लोग मुन्तज़िर ही रहे कि हमें टूटा हुआ देखें,\n" +
                "और हम थे कि दर्द सहते-सहते पत्थर के हो गए।");
        dard.add("पास जब तक वो रहे दर्द थमा रहता है,\n" +
                "फैलता जाता है फिर आँख के काजल की तरह।");
        dard.add("तकलीफ ये नहीं कि तुम्हें अज़ीज़ कोई और है,\n" +
                "दर्द तब हुआ जब हम नजरंदाज किए गए।");
        dard.add("अपना कोई मिल जाता तो हम फूट के रो लेते,\n" +
                "यहाँ सब गैर हैं तो हँस के गुजर जायेगी।");
        dard.add("अब तो दामन-ए-दिल छोड़ दो बेकार उमीदों,\n" +
                "बहुत दर्द सह लिए मैंने बहुत दिन जी लिया मैंने।");
        dard.add("तुझसे पहले भी कई जख्म थे सीने में मगर,\n" +
                "अब के वह दर्द है दिल में कि रगें टूटती हैं।");
        dard.add("सब सो गए अपना दर्द अपनों को सुना के,\n" +
                "कोई होता मेरा तो मुझे भी नींद आ जाती।");
        dard.add("झूठी हँसी से जख्म और बढ़ता गया,\n" +
                "इससे बेहतर था खुलकर रो लिए होते।");
        dard.add("दिल के ज़ख्मों को हवा लगती है,\n" +
                "साँस लेना भी यहाँ आसान नहीं है।");
        dard.add("मुझको तो दर्द-ए-दिल का मज़ा याद आ गया,\n" +
                "तुम क्यों हुए उदास तुम्हें क्या याद आ गया?\n" +
                "कहने को जिंदगी थी बहुत मुख्तसर मगर,\n" +
                "कुछ यूँ बसर हुई कि खुदा याद आ गया।");
        dard.add("किस दर्द को लिखते हो इतना डूब कर,\n" +
                "एक नया दर्द दे दिया है उसने ये पूछकर।");
        dard.add("हमें देख कर जब उसने मुँह मोड़ लिया,\n" +
                "एक तसल्ली हो गयी चलो पहचानते तो हैं।");
        dard.add("वो तो अपना दर्द रो-रो कर सुनाते रहे,\n" +
                "हमारी तन्हाइयों से भी आँख चुराते रहे,\n" +
                "हमें ही मिल गया खिताब-ए-बेवफा क्योंकि,\n" +
                "हम हर दर्द मुस्कुरा कर छुपाते रहे।");
        dard.add("हँसते हुए ज़ख्मों को भुलाने लगे हैं हम,\n" +
                "हर दर्द के निशान मिटाने लगे हैं हम,\n" +
                "अब और कोई ज़ुल्म सताएगा क्या भला,\n" +
                "ज़ुल्मों सितम को अब तो सताने लगे हैं हम।");
        dard.add("दर्द हमने संभाला है हमने आँसू बहाए हैं,\n" +
                "बेशक वजह तुम थे पर दिल तो हमारा था।");
        dard.add("ज़हर देता है कोई कोई दवा देता है,\n" +
                "जो भी मिलता है मेरा दर्द बढ़ा देता है।");
        dard.add("मंजिलों से बेगाना आज भी सफ़र मेरा,\n" +
                "है रात बेसहर मेरी दर्द बेअसर मेरा।");
        dard.add("लोग जलते रहे मेरी मुस्कान पर,\n" +
                "मैंने दर्द की अपने नुमाईश न की\n" +
                "जब जहाँ जो मिला अपना लिया,\n" +
                "जो न मिला उसकी ख्वाहिश न की।");
        dard.add("यूँ तो हर एक दिल में दर्द नया होता है,\n" +
                "बस बयान करने का अंदाज़ जुदा होता है,\n" +
                "कुछ लोग आँखों से दर्द को बहा लेते हैं\n" +
                "और किसी की हँसी में भी दर्द छुपा होता है।");
        dard.add("मेरे इस दर्द की वजह भी वो हैं,\n" +
                "और मेरे दर्द की दवा भी तो वो हैं,\n" +
                "वो नमक ज़ख्मों पे लगाते हैं तो क्या,\n" +
                "मोहब्बत करने की वजह भी तो वो हैं।");
        dard.add("एक नया दर्द मेरे दिल में जगा कर चला गया,\n" +
                "कल फिर वो मेरे शहर में आकर चला गया,\n" +
                "जिसे ढूंढते रहे हम लोगों की भीड़ में,\n" +
                "मुझसे वो अपने आप को छुपा कर चला गया।");
        dard.add("शायरी में कहाँ सिमटता है दर्द-ए-दिल दोस्तो,\n" +
                "बहला रहे हैं खुद को जरा कागजों के साथ।");

        System.out.println("Dard " + dard.size());

        attitude = new ArrayList<>();
        attitude.add("Attitude तो अपना भी खानदानी है,और तू मेरे दिल की रानी है, इसलिये कह रहा हूँ मान जा, क्योंकि अपनी तो करोड़ो दीवानी हैं।");
        attitude.add("मेरा वाला थोड़ा लेट आयेगा, लेकिन जब आयेगा तो लाखो में एक आयेगा।");
        attitude.add("किरदार में मेरी भले ही अदाकारियां नही है, खुद्दारी है, Attitude है, पर मक्कारियां नही है।");
        attitude.add("इतना Attitude न दिखा जिंदगी में तकदीर बदलती रहती है, शीशा वहीं रहता है, पर तस्वीर बदलती रहती है।");
        attitude.add("शेर अपना शिकार करते हैं और हम अपने Attitude से वार करते हैं।");
        attitude.add("प्यार, इश्क, मोहब्बत सब धोकेबाजी है, अपनी तो Life में Attitude ही काफी है।");
        attitude.add("माना की तू किसी रानी से कम नही, लेकिन वो रानी ही क्या जिसके राजा हम नही।");
        attitude.add("रहते आस पास ही हैं पर पास नही होते, कुछ लोग मुझसे जलते हैं, बस वो खास नही होते।");
        attitude.add("बेबक्त, वेबजह, वेहिसाब मुस्कुरा देते हैं, हम अपने आधे दुश्मनों को तो बस यूँ जी जला देते हैं।");
        attitude.add("दिल में मोहब्बत का होना ज़रूरी है, वरना याद तो रोज दुश्मन भी किया करते हैं।");
        attitude.add("हम कभी किसी के आगे सिर झुकाया नही करते,\n" +
                "हम कभी अपने आँसू बहाया नही करते,\n" +
                "हम जो एक बार चले गए तो तुम्हे पछताना तो पड़ेगा,\n" +
                "क्योंकि हम कभी लौट कर आया नही करते।");
        attitude.add("हम तो हर जगह पर राज कर करते हैं,\n" +
                "जो पसन्द करते हैं उनके दिल पर राज करते हैं,\n" +
                "जो पसन्द नही करते हैं उनके दिमाग पर राज करते हैं।");
        attitude.add("अपनी ज़िन्दगी में काम करो ऐसा के पहचान बन जाये,\n" +
                "इस तरह से चलो के निशान बन जाये,\n" +
                "ज़िन्दगी तो हर कोई काट लिया करता है,\n" +
                "इस तरह से ज़िन्दगी गुजारो के मिसाल बन जाये।");
        attitude.add("हम वो नही जो किसी के गम में मर जाये,\n" +
                "हम तो वो समुंदर हैं जो कहीं भी बिखर जाएं,\n" +
                "तू तरसता रहना चाहत की बूंद बूंद को,\n" +
                "हम वो बादल हैं जो प्यार बन कर बरस जाएं।");
        attitude.add("हमसे जलने वाले भी कमाल के होते हैं,\n" +
                "महफिले तो खुद की होती हैं पर चर्चे हमारे होते हैं।");
        attitude.add("हम तो शौक तलवारों के पाला करते हैं,\n" +
                "बन्दूकों की ज़िद तो बच्चे किया करते हैं।");
        attitude.add("हम तो अपना नाम नही चलाया करते हैं,\n" +
                "हम तो अपना बस चलाया करते हैं।");
        attitude.add("तू कभी ये न समझना हम तेरे काबिल नही है,\n" +
                "लोग तड़पते हैं हमारे लिए जिसे हम हासिल नही हैं।");
        attitude.add("हम से है ज़माना, ज़माने से हम नही,\n" +
                "कोई हम से नज़रे मिलाये, किसी मे इतना दम नही।");
        attitude.add("अभी तो मैं काँच हूँ, इसलिए दुनिया को चुभता हूँ,\n" +
                "जब आईना बन गया तो सारा ज़माना देखेगा।");
        attitude.add("हम तो दिलों पर राज किया करते हैं,\n" +
                "रूठे हुए को भी हम मना लिया करते हैं,\n" +
                "मुलाकातें तो हमारी सबसे कम ही होती हैं,\n" +
                "लेकिन हम जब भी मिलते हैं तो मुस्कुरा दिया करते हैं।");
        attitude.add("मैं तो वहीं से गुजरता हूँ जहाँ अपना पन झलकता है।\n" +
                "वरना आवाज़ तो ये ज़माना दिया करता है।");
        attitude.add("वैसे तो हम दिल के बहुत अच्छे हैं,\n" +
                "फिर भी लोग खराब कहते हैं,\n" +
                "ये ज़माने वाले हमे बिगड़े हुये नबाब कहते हैं,\n" +
                "इस कदर इस ज़माने ने बदनाम किया है,\n" +
                "अब तो हम पानी भी पियें तो लोग शराब कहते हैं।");
        attitude.add("इतना Attitude मत दिखा अपने दिमाग का,\n" +
                "जितना तेरा दिमाग है,\n" +
                "उतना तो मेरा दिमाग खराब रहता है।");
        attitude.add("अब हम तो नए नफरत करने वाले तलाशा करते हैं,\n" +
                "क्योंकि पुराने वाले तो अब हमसे मोहब्बत किया करते हैं।");
        attitude.add("जो लोग नफरत करते हैं, वो लोग अच्छे लगते हैं मुझे,\n" +
                "क्योंकि अगर सब मोहब्बत करेंगे, तो कहीं नज़र न लग जाये मुझे।");
        attitude.add("ज़रा एक बात सुन, मेरे दिल की धड़कन की तू ज़रूरत है, मेरी ज़िंदगानी में सिर्फ तेरी ही ज़रूरत है,\n" +
                "और दुनिया को जलाने के लिए मुझे तेरे साथ कि ज़रूरत है।");
        attitude.add("जा वेबफा तेरी नफरत में वो दम कहाँ,\n" +
                "जो मेरे इश्क को मिटा दे,\n" +
                "ये इश्क है कोई खेल का मैदान नही,\n" +
                "जिसे कल खेला और आज रो कर भुला दे।");
        attitude.add("जो खुशियां हमे खैरात में मिले,\n" +
                "उसे हम पसन्द नही किया करते हैं,\n" +
                "क्योंकि गम में कितने भी काले बादल छा जाएं,\n" +
                "फिर भी हम नबाबो की तरह जिया करते हैं।");
        attitude.add("जब भी कोई हमे कील की तरह चुभने लगते है,\n" +
                "उसे हम हथौड़ी बनकर ठोक दिया करते हैं।\n");
        attitude.add("लाखों के दिलों की धड़कन हमारे लिए धड़कती है,\n" +
                "न जाने कितनो की चूड़ियां हमारे लिए खनकती हैं,\n" +
                "तुम हमारी बेशक न हो सकीं,\n" +
                "लेकिन हमारे लिए तो लाखों तड़पती हैं।");
        attitude.add("हम हमेशा आंखों में नमी और अपने इस्टाइल में कभी कमी नही रखते हैं।\n" +
                "ये दुनिया वाले हमे आज दो ही चीजो से जानते हैं,\n" +
                "हम अपनी आंखें शराबी और Attitude नबाबी रखते हैं।");
        attitude.add("चर्चे हमेशा उन्ही के हुआ करते हैं,\n" +
                "जिनके अंदाज़ अलग हुआ करते हैं।");
        attitude.add("ज़रा अपनी निगाहे मेरे चेहरे से हटा,\n" +
                "तू बेचैन हो जाएगी,\n" +
                "तू मेरे क्यूट से इस्टाइल पे,\n" +
                "अपना दिल हार जाएगी।");
        attitude.add("हमसे प्यार से मिलोगे तो,\n" +
                "फूलो की तरह खिल जायेगें,\n" +
                "और हमसे नफरत से मिलोगे तो,\n" +
                "काटें नही हम तलवार बन जायेंगे।");
        attitude.add("मैंने तुझसे मोहब्बत की है कोई गुलामी नही,\n" +
                "मैं जानता हूँ तू किसी राजकुमारी से कम नही,\n" +
                "लेकिन वो राजकुमारी ही क्या जिसके राजकुमार हम नही।");
        attitude.add("लाख कोशिशें करते हैं लोग,\n" +
                "पर सबको हासिल तख्तो ताज नही होता है,\n" +
                "शोहरत तो कमाना आसान है,\n" +
                "पर सबका हमारे जैसा इस्टाइल नही होता है।");
        attitude.add("कोशिशें करते करते बड़े बड़े लोग निकल लिए\n" +
                "हमे झुकाने में,\n" +
                "तू भी एक कोशिश करके देख,\n" +
                "तेरी भी उम्र गुज़र जाएगी हमे गिराने में।");
        attitude.add("हम तो ज़िन्दगी में दो ही लोगो से मोहब्बत करते हैं,\n" +
                "एक उससे मोहब्बत करते हैं जिसने हमे जन्म दिया,\n" +
                "और एक उससे मोहब्बत करते हैं जिसने मेरे लिये जन्म लिया।");
        attitude.add("अगर ज़िन्दगी में कुछ पाने की चाह करो,\n" +
                "तो अपना अंदाज़ बदलो इरादे मत बदला करो।");
        attitude.add("जो सुधर जाए उसमे के हम नही,\n" +
                "और कोई हमे सुधार सके,\n" +
                "अभी तक किसी मे इतना दम नही।");
        attitude.add("हम तो मंजिलों से नही सफर से मिलना पसन्द करते हैं,\n" +
                "इस ज़माने के साथ रहने की ख्वाइश कौन रखता है,\n" +
                "हम तो अपने Attitude के साथ मरना पसन्द करते हैं।");
        attitude.add("मेरे साथ रहने की कोशिश करते हो,\n" +
                "तो मुझे बर्दास्त करना सीखो,\n" +
                "वरना अपनी औकाद में रहना सीखो।");
        attitude.add("मेरी रगों में खून आज भी खानदानी है,\n" +
                "ये दुनिया मेरे इस्टाइल के साथ साथ,\n" +
                "मेरे Attitude की भी दीवानी है।");
        attitude.add("मैं हमेशा अपने इरादों को साफ रखता हूँ,\n" +
                "इसलिए हमेशा लोगों के खिलाफ रहता हूँ।");
        attitude.add("ज़िन्दगी में कितने सारे दुख हैं,\n" +
                "फिर भी फेमस हमारे लुक्स है।\uD83D\uDE0E");
        attitude.add("हम भरोसा कभी करते नही गैरो पर,\n" +
                "क्योंकि हमें खड़ा होना है अपने ही पैरों पर।");
        attitude.add("अब ये ज़माना हमसे जलने लगा है,\n" +
                "लगता है ज़माने पे अपना बस चलने लगा है।");
        attitude.add("दौड़ में हिस्सा वो लोग लेते हैं,\n" +
                "जो अपना लक आज़माया करते हैं,\n" +
                "हम तो खिलाड़ियों के खिलाड़ी हैं,\n" +
                "हम तो लक के साथ खेला करते हैं।");
        attitude.add("सिर्फ इस बात पर दुनिया वाले रुठ जाया करते हैं,\n" +
                "क्योंकि हम किसी के आगे अपना सिर नही झुकाया करते हैं।");
        attitude.add("दिलों में मोहब्बत बहुत जरूरी हुआ करती है,\n" +
                "याद की क्या है याद तो दुश्मनो को भी आ जाया करती है।");
        attitude.add("तू मुझे भुलाकर है खुश तो तू मुझे बेशक भूला दे,\n" +
                "तुझसे जुदा होकर सम्भलना हमे भी बेशक आता है,\n" +
                "हमारी आदत नही है रँग बदलने की वरना,\n" +
                "तेरी तरह रँग बदलना बेशक हमे भी आता है।");
        attitude.add("मेरी पहचान में वो बात है जो औरो में कहाँ,\n" +
                "न जाने कितनों की पहचान बन गई,\n" +
                "मुझे बदनाम करते करते।");
        attitude.add("जब हमारी मुलाकात हमारे दुश्मनो से हो गई,\n" +
                "और भी तेज चाँद सितारों की जगमगाहट हो गई,\n" +
                "हम तो दुश्मनो को जलाकर खाक करने ही वाले थे,\n" +
                "फिर ये न जाने क्यूँ अचानक से बरसात हो गई।");
        attitude.add("जिन चीजों का कोई मोल नही हुआ करता है,\n" +
                "हमे तो उन्ही चीज़ों को पाने का शौक हुआ करता है।");
        attitude.add("हम ज़ुबान के तीर चलाया करते हैं, इशारों में बात किया नही करते।\n" +
                "हम अपने पैर आसमान पर रखने का हौसला रखते हैं, ज़मीन की चाह हम रखा नही करते।\n" +
                "हम तो वो हैं जो हर हालत को अपने दम पर बदलना जानते हैं,\n" +
                "हम तो वो हैं जो वक्त को भी बदल डालें वक्त के आगे झुकना हम गवारा किया नही करते।");
        attitude.add("हम तो वो तालाब हैं,\n" +
                "जहां शेर भी आ जाये,\n" +
                "तो वो भी सिर झुका कर पानी पीते हैं।");
        attitude.add("जहां दूसरों के लिए भीड़ खड़ी हो,\n" +
                "वहाँ खड़ा होना मकसद नही है मेरा,\n" +
                "बल्कि मेरे लिए खुद भीड़ खड़ी हो,\n" +
                "वो बनना मकसद है मेरा।");
        attitude.add("हमारी तो कुंडली मे शनि है,\n" +
                "हमारे दिल मे मनी है,\n" +
                "और हमसे दुश्मनी है,\n" +
                "तो तेरे लिए ये तीनो ही बहुत महंगी हैं।");
        attitude.add("दुनिया मे Attitude से जीने का बड़ा मजा आता है,\n" +
                "लोग हमसे जलना छोड़ा नही करते हैं,\n" +
                "और हमें लोगो को जलाने में मज़ा आता है।");
        attitude.add("हुकूमत करना वही जानता है जो दिलों पर राज करता है, वरना गली के मुर्गो के सिर पर भी ताज होता है।");
        attitude.add("अपना इस्टाइल ऐसा बनाओ इस दुनिया मे,\n" +
                "दुनिया वाले खुद सोचें हम आये कैसे इनकी नज़रों में।");
        attitude.add("हम कभी अपनी तारीफ के मोहताज हुआ नही करते,\n" +
                "अगर कोई कर दे अपनी तारीफ,\n" +
                "तो उसे हम इनकार भी नही करते।");
        attitude.add("अभी अपना टाइम खराब है इसलिए झुक रहा हूँ,\n" +
                "जब दिमाग खराब होगा न तब मैं सबका हिसाब लेता हूँ।");
        attitude.add("मेरे Attitude को तू जान ले,\n" +
                "ये तेरे बस की बात कहाँ,\n" +
                "मेरे इस्टाइल को तू मान ले,\n" +
                "तेरी ये औकाद कहाँ।");
        attitude.add("ओ मिस्टर हम इतने भी नादान नहीं है,\n" +
                "तुम हमसे टाइम पास करने की कोशिश करो,\n" +
                "और इसे हम प्यार समझने की भूल करें।");
        attitude.add("ये चश्मा तो बस अपना एक शौक है,\n" +
                "किसी को भी दीवाना बनाने के लिए,\n" +
                "हमारी ये नशीली आँखे ही काफी है।");
        attitude.add("चमक उस सूरज की नही है, वो तो मेरे किरदार की है।\n" +
                "बात ये मेरे लफ़्ज़ों की नही, आसमान के अखबार की है।\n" +
                "अगर मैं चलूँ तो ये दुनिया चले सारी,\n" +
                "बात ये सिर्फ मेरे Attitiude की ही नही, ये मेरे इस्टाइल की है।");
        attitude.add("किसी को भी मैं निचा दिखाऊ,\n" +
                "ऐसी मैं अपनी ये आदत नही रखता,\n" +
                "और कोई मुझे नीचा दिखाए,\n" +
                "तो कोई ऐसी किस्मत नही रखता।");
        attitude.add("रास्ते बदल जाएं या टाइम बदल जाये,\n" +
                "कुछ भी हो हम तो अपनी मन्ज़िल पाएंगे,\n" +
                "और जो खुद को समझते हैं राजा\n" +
                "उन्हें एक दिन अपनी महफ़िल में ज़रूर नचाएंगे।");
        attitude.add("अरे सुन ले दिबानी थी दीवानी हूँ,\n" +
                "अरे पागल तेरी थोड़ी हूँ,\n" +
                "वो तो मैं अपने Attitude की दिबानी हूँ।");
        attitude.add("तेरे इश्क़ में और मेरी फितरत में\n" +
                "सिर्फ एक ही चीज़ का फर्क है,\n" +
                "तेरा Attitude नही जाता है\n" +
                "और मुझे झुकना नही आता है।");
        attitude.add("हम आज भी अपने जिगर में वो दम रखते हैं,\n" +
                "छा जाते हैं वहाँ जहाँ हम जमके कदम रखते हैं।");
        attitude.add("अपना तो चाइना जैसा दिमाग है,\n" +
                "सही चलते चलते ही एक दम खराब है।");
        attitude.add("हम किसी का भी कर्ज़ नही रखा करते हैं,\n" +
                "एक सुनते है और दो सुना दिया करते हैं।");
        attitude.add("हम तो वो हैं जो निगाहों से निगाहों की बात जान लेते हैं,\n" +
                "तुझसे हमने इश्क किया है इसलिए तेरा झूठ भी सच मान लेते हैं।");
        attitude.add("हम जानते हैं तेरे Attitude की भी एक कहानी है,\n" +
                "तेरी क्यूटनेस और स्टाइल बहुत नबाबी है,\n" +
                "लेकिन फिर भी तुझसे ज़्यादा ये दुनिया मेरी दिबानी है।");
        attitude.add("Attitude तो हम अपना भी खतरनाक रखते हैं,\n" +
                "जो हमे याद न करे उसे हम दिल से निकाल दिया करते हैं।");
        attitude.add("जब से चलने लगा है नाम हमारा,\n" +
                "तब से जलने लगा है ज़माना ये सारा।");
        attitude.add("तू तो मेरे सपनों की रानी है\n" +
                "और हमारा Attitude ज़रा खानदानी है,\n" +
                "एक बार मे मानती है तो मान जा,\n" +
                "वरना अपने इस्टाइल की तो लाखों दिबानी हैं।");
        attitude.add("जो लोग तन्हाईयो में जिया करते हैं,\n" +
                "वो लोग दूसरों की मदद कर दिया करते हैं।");
        attitude.add("हम तो अपनी ज़िंदगानी बस यूं ही नाप  रहे हैं,\n" +
                "और देखो हमारे दुश्मन बस यूं ही कांप रहे हैं।");
        attitude.add("हम तो बस इसी बात पे अड़े रहते हैं,\n" +
                "दुश्मन से लड़ाई में मर गए तो माफ कर देते हैं,\n" +
                "और दुश्मन से लड़ाई में बच गए तो एक एक को साफ कर देते हैं।");
        attitude.add("अरे सुनले पगली तुझे हमे अपना बनाना है,\n" +
                "तो तुझे अपना दिल और दिमाग हमारे काबिल बनाना है।");
        attitude.add("मैं बहुत नॉटी नॉटी सी हूँ,\n" +
                "मैं दिल के साथ साथ दिमाग भी खराब करती हूँ।");
        attitude.add("इस्टाइल तो सिर्फ शोक के लिए रखा करते हैं,\n" +
                "वरना हमारी नशीली आँखो के इशारे ही घायल कर दिया करते हैं।");
        attitude.add("थोड़े ही पलों की खामोशिया हैं,\n" +
                "फिर देखना एक दिन कानो में शोर आएगा,\n" +
                "अभी तो सिर्फ तुम्हारा वक्त ही चल रहा है,\n" +
                "लेकिन अपना तो एक दिन दौर आएगा।");
        attitude.add("हम तो बस एक ही ख्वाब देखा करते हैं,\n" +
                "अपने सिर पे ताज हो,\n" +
                "बगल में खड़ी मुमताज़ हो,\n" +
                "और इस दुनिया पर अपना राज़ हो।");
        attitude.add("गज़ब की अदा गज़ब का इस्टाइल हो,\n" +
                "बड़ी शिद्दत से करो नफरत हो या प्यार हो।");
        attitude.add("मेरे शहर में मत करना अपना ये ड्रामा,\n" +
                "मैं यहां इतना मशहूर हूँ जितना अमेरिका में ओबामा।");
        attitude.add("अरे अपना Attitude तो बच्चे दिखाया करते हैं,\n" +
                "लेकिन हम तो लोगो की औकात  दिखाया करते हैं।");
        attitude.add("पूरा हक दोगे उसे निभाने का,\n" +
                "तो तेरी नफरत भी कबूल करते हैं,\n" +
                "जो हमे खैरात में मिले,\n" +
                "उसकी तो दी हुई मोहब्बत भी कुबूल नही करते हैं।");
        attitude.add("हमारे जिगर में इतना दम है,\n" +
                "सबसे आगे हम हैं,\n" +
                "यकीन नही है तो देख ले आ कर,\n" +
                "हम तो आइटम बम हैं।");
        attitude.add("जब दुश्मनो की दुश्मनी अच्छी लगने लगती है,\n" +
                "तो दुश्मनो को अपनी औकात पता लगने लगती है।");
        attitude.add("हमसे दुश्मनी करने वालो क्या तुम्हारी शामत आई है,\n" +
                "क्या तुम्हें पता नही है यमराज हमारा छोटा भाई है।");
        attitude.add("मोहब्बत करना तो मेरा उसूल है,\n" +
                "मेरे खून में बस यही जनून है,\n" +
                "अगर तुझे मेरा साथ देना है तो आजा,\n" +
                "वरना तुझसे भी ज़्यादा कितनी लडकिया दुनिया मे कूल हैं।");
        attitude.add("कोई भी मुझे हरा कर मेरी जान लेजा सकते हैं,\n" +
                "हम इतना अपने अंदर जुनून रखते हैं,\n" +
                "लेकिन मुझे कोई धोखा देता है,\n" +
                "तो फिर उसे हम दूसरा मौका नही देते हैं।");
        attitude.add("जिनके पास जिगर होता है,\n" +
                "उनका डर से कोई वास्ता नही होता है,\n" +
                "हम अपने कदम उसी जगह रखते हैं\n" +
                "जहां कोई रास्ता नही होता है।");
        attitude.add("मैं ज़रा सी क्यूट क्या हुई,\n" +
                "सारी दुनिया मुझसे जेल्स हुई।");
        attitude.add("किसी का भी इस्टाइल हमारे जैसा नही है आज की तारीख में,\n" +
                "यही वजह है जो लफ्ज़ कम पड़ जाते हैं हमारी तारीफ में।");
        attitude.add("कल भी हम ही हम थे आज भी हम ही हम रहेंगे\n" +
                "और जो हमसे टक्कर ले उसे हम कभी जीने नही देंगे");
        attitude.add("इश्क करो वफ़ा करो, अगर फिर भी औकात दिखाए तो दफा करो।");
        attitude.add("अपने जूनून को आवाज़ बना देंगे, अपनी ज़िद को इतिहास बना देंगे, कह दो लोगो को हमारी बुराई करना छोड़ दे, क्योंकि अगर हमे गुस्सा आ गया तो लोगो को उनकी औकात दिखा देंगे। ");
        attitude.add("हक़ से दो तो तुम्हारी नफरत भी कबूल हमें,\n" +
                "खैरात में तो हम तुम्हारी मोहब्बत भी न लें।");
        attitude.add("सूरज ढला तो कद से ऊँचे हो गए साये,\n" +
                "कभी पैरों से रौंदी थी यहीं परछाइयां हमने।");
        System.out.println("Attitude " + attitude.size());

        love = new ArrayList<>();
        //https://bestnow.in/love-shayari-hindi/20/
        love.add("एक उमर बीत चली है तुझे चाहते हुए,\n" +
                "तू आज भी बेखबर है कल की तरह।");
        love.add("अना कहती है इल्तेजा क्या करनी,\n" +
                "वो मोहब्बत ही क्या जो मिन्नतों से मिले।");
        love.add("जिंदगी में कोई प्यार से प्यारा नही मिलता,\n" +
                "जिंदगी में कोई प्यार से प्यारा नही मिलता,\n" +
                "जो है पास आपके उसको सम्भाल कर रखना,\n" +
                "क्योंकि एक बार खोकर प्यार दोबारा नही मिलता।");
        love.add("बहुत सुकून मिलता है जब उनसे हमारी बात होती है,\n" +
                "वो हजारो रातों में वो एक रात होती है,\n" +
                "जब निगाहें उठा कर देखते हैं वो मेरी तरफ,\n" +
                "तब वो ही पल मेरे लीये पूरी कायनात होती है।");
        love.add("आग लगी दिल में जब वो खफ़ा हुए,\n" +
                "एहसास हुआ तब, जब वो जुदा हुए,\n" +
                "करके वफ़ा वो हमे कुछ दे न सके,\n" +
                "लेकिन दे गये बहुत कुछ जब वो वेबफा हुए।");
        love.add("किसी न किसी को किसी पर एतवार हो जाता है,\n" +
                "एक अजनबी सा चेहरा ही यार हो जाता है,\n" +
                "खूबियों से ही नही होती मोहब्बत सदा,\n" +
                "किसी की कमियों से भी कभी प्यार हो जाता है।");
        love.add("दिल का हाल बताना नही आता,\n" +
                "हमे ऐसे किसी को तड़पाना नही आता,\n" +
                "सुनना तो चाहतें हैं हम उनकी आवाज़ को,\n" +
                "पर हमे कोई बात करने का बहाना नही आता।");
        love.add("हर कदम हर पल हम आपके साथ है,\n" +
                "भले ही आपसे दूर सही, लेकिन आपके पास हैं,\n" +
                "जिंदगी में हम कभी आपके हो या न हों,\n" +
                "लेकिन हमे आपकी कमी का हर पल एहसास हैं।");
        love.add("इश्क करती हूँ तुझसे अपनी जिंदगी से ज्यादा,\n" +
                "मैं डरतीं हूँ मौत से नही तेरी जुदाई से ज्यादा,\n" +
                "चाहे तो हमे आज़मा कर देख किसी और से ज्यादा,\n" +
                "मेरी जिंदगी में कुछ नही तेरी आवाज़ से ज्यादा।");
        love.add("जब खामोश निगाहों से बात होती है,\n" +
                "तो ऐसे ही मोहब्बत की शुरुआत होती है,\n" +
                "हमतो बस खोये ही रहतें हैं उनके ख्यालों में,\n" +
                "पता ही नही चलता कब दिन कब रात होती है।");
        love.add("हकीकत कहो तो उन्हें ख्वाब लगता है,\n" +
                "शिकवा करो तो उन्हें मज़ाक लगता है,\n" +
                "कितनी शिद्दत से हम उन्हें याद करते हैं,\n" +
                "और एक वो हैं जिन्हें ये सब मजाक लगता है।");
        love.add("तेरी मोहब्बत ने हमे बेनाम कर दिया,\n" +
                "हमे हर ख़ुशी से अंजान कर दिया,\n" +
                "हमने तो कभी नही चाहा था हमे मोहब्बत हो,\n" +
                "लेकिन उसकी पहली नज़र ने हमे नीलाम कर दिया।");
        love.add("इस नजर ने उस नजर से बात करली,\n" +
                "रहे खामोश मगर फिर भी बात करली,\n" +
                "जब मोहब्बत की फ़िज़ा को खुश पाया,\n" +
                "तो दोनों निगाहों ने रो रो कर बरसात करली।");
        love.add("तुझे देख कर ये जहाँ रंगीन नजर आता है,\n" +
                "तेरे बिना दिल को चैन कहां आता है,\n" +
                "तू ही है मेरे इस दिल की धड़कन,\n" +
                "तेरे बिना ये जहां बेकार नज़र आता है।");
        love.add("तू तोड़ दे वो कसम जो तूने खाई है,\n" +
                "कभी कभी याद करने में क्या बुराई है,\n" +
                "तुझे याद किये बिना रहा भी तो नही जाता,\n" +
                "तूने दिल में जगह जो ऐसी बनाई है।");
        love.add("इश्क सभी को जीना सीखा देता है,\n" +
                "वफ़ा के नाम पर मरना सीखा देता है,\n" +
                "इश्क नही किया तो करके देखना,\n" +
                "ज़ालिम हर दर्द सहना सिखा देता है।");
        love.add("आपकी परछाई हमारे दिल में है,\n" +
                "आपकी यादें हमारी आँखों में हैं,\n" +
                "आपको हम भुलाएं भी कैसे,\n" +
                "आपकी मोहब्बत हमारी सांसो में हैं।");
        love.add("तेरी झील सी आँखों में डूब जाने का दिल चाहता है,\n" +
                "वफ़ा पर तेरी बर्बाद हो जाने का दिल चाहता है,\n" +
                "कोई सम्भाले हमे, बहक रहे हैं कदम,\n" +
                "तेरे इश्क में मर जाने का दिल चाहता है।");
        love.add("तेरी मोहब्बत का ये कितना खूबसूरत एहसास है,\n" +
                "अब तो मुझे लगता है हर पल की तू मेरे कहीँ आस पास है।");
        love.add("मोहब्बत का कोई मुकाम नही होता है,\n" +
                "वो जो रास्ता होता हैं न वही खूबसूरत तमाम होता है।");
        love.add("आप दिल से दूर हैं और पास भी,\n" +
                "आप लवो की हँसी हो, और आँसू भी,\n" +
                "आप दिल का सुकून हो,और बेचैनी भी,\n" +
                "आप हमारी अमानत हो,और एक सपना भी।");
        love.add("कुछ देर का इंतज़ार मिला हमको,\n" +
                "पर सबसे प्यारा यार मिला हमको,\n" +
                "तेरे बाद किसी और की ख्वाइश न रही,\n" +
                "क्योंकि तेरे प्यार से सब कुछ मिला हमको।");
        love.add("न चाँद की चाहत, न तारों की फरमाइश,\n" +
                "हर पल में हो तू मेरे साथ बस यही है मेरी ख्वाइश।");
        love.add("जाम पर जाम पीने से क्या फायदा,\n" +
                "शाम को पीके सुबह को उतर जाएगी,\n" +
                "जरा दो घूट मेरे इश्क की पी कर तो देख,\n" +
                "तेरी सारी जिंदगी नशे में गुजर जायेगी।");
        love.add("हमसे एक वादा करो हमे रुलाओगे नही,\n" +
                "हालात जो भी हों कभी हमे भुलाओगे नही,\n" +
                "अपनी आँखों में छुपा कर रखोगे हमको,\n" +
                "और फिर किसी को दिखाओगे नही।");
        love.add("खुदासे बस आपकी ख़ुशी मांगतें हैं,\n" +
                "दुआओं में आपकी हसीं मांगतें हैं,\n" +
                "सोचतें हैं आपसे क्या मांगे,\n" +
                "चलो आपसे उम्र भर की मोहब्बत मांगतें हैं।");
        love.add("कभी हँसा देते हो तुम,कभी रुला देती हो तुम,\n" +
                "कभी कभी नींद से जगा देती हो तुम,\n" +
                "लेकिन जब भी हमे दिल से याद करती हो,\n" +
                "तो सच में हमारी जिंदगी का एक पल बड़ा देती हो तुम।");
        love.add("न गुलफाम चाहिये, न कोई सलाम चाहिये,\n" +
                "मोहब्बत का बस कोई पैगाम चाहिये,\n" +
                "और जिसको पीकर उड़ जायें होश हमारे,\n" +
                "हमारे ल्वजो को तो ऐसा ज़ाम चाहिये।");
        love.add("जब किसी रात आपको किसी की याद सताए,\n" +
                "और ठंडी हवा आपके बालों को सहलाये,\n" +
                "तो अपनी आँखे बन्द करके सो जाना,\n" +
                "और चुपके से हम आपके ख्वाबो में आ जायें।");
        love.add("जाने कब आपसे प्यार का इज़हार होगा,\n" +
                "जाने कब आपको हमसे प्यार जोगा,\n" +
                "गुजर रही हैं आपकी ही याद में ये रातें,\n" +
                "जाने कब आपको भी हमारा इंतज़ार होगा।");
        love.add("फूल खिलतें हैं बहारों का समा होता है,\n" +
                "ऐसे मौसम में ही तो प्यार जमा होता है,\n" +
                "दिल की बातें होठों से नही कहते हैं,\n" +
                "ये फ़साना तो निगाहों से बयां होता है।");
        love.add("अब हम न तुम्हे खोना चाहते हैं,\n" +
                "अब न तुम्हारी यादों में रोना चाहतें हैं,\n" +
                "बस तुम्हारा साथ मिले हमे हर पल,\n" +
                "अब बस इतनी सी बात तुमसे कहना चाहते हैं।");
        love.add("सफर वहीं तक जहाँ तक तुम हो,\n" +
                "नजर वहीं तक जहां तक तुम हो,\n" +
                "हज़ारों गुल देखें हैं गुलशन में हमने,\n" +
                "पर खुशबू वहीं तक जहां तक तुम हो।");
        love.add("धीरे से आकर हमारे दिल में उतर जाते हो,\n" +
                "खुशबू की तरह मेरी सांसो में बिखर जाते हो,\n" +
                "अब तो तुम्हारे इश्क में ये हाल हो गया है,\n" +
                "सोतें जागते बस तुम ही तुम नजर आते हो।");
        love.add("दीवाना हूँ तेरा मुझे इंकार तो नही,\n" +
                "कैसे मैं कह दूँ मुझे प्यार नही,\n" +
                "कुछ शरारत तो तेरी निगाहों की भी थी,\n" +
                "मैं अकेला इसका गुनहा गार तो नही।");
        love.add("ख्वाइश है तुझे अपना बनाने की,\n" +
                "और कोई ख्वाइश नही इस दीवाने की,\n" +
                "शिकायत मुझे तुझसे नही खुदा से है,\n" +
                "क्या ज़रूरत थी तुझे इतना खूबसूरत बनाने की।");
        love.add("हर फैसला किया नही जाता सिक्का उछाल के,\n" +
                "ये दिल का मामला होता है जरा देख-भाल के\n" +
                "तुम क्या जानो हमे तुमसे कितनी मोहब्बत है,\n" +
                "कहो तो अभी रख दूँ अपना कलेजा निकल के।");
        love.add("वो आँखों से अपनी शरारत करते हैं\n" +
                "वो अपनी अदाओं से कयामत करतें हैं।\n" +
                "हमारी निगाहें उनके चहरे से हठतीं नही,\n" +
                "और वो हमारी निगाहों की शिकायत करतें हैं।");
        love.add("जब ख्याल तेरा मेरे दिल में आता रहा,\n" +
                "तो बहुत देर तक मेरा दिल जोर से धड़कता रहा,\n" +
                "जो तेरा जिक्र कल मेरे घर में छिड़ गया,\n" +
                "तो बहुत देर तक मेरा घर महकता रहा।");
        love.add("सपना \uD83D\uDCAD कभी साकार नही होता, मोहब्बत \uD83E\uDDE1 का कोई आकार \uD83D\uDCA0 नही होता, चाहे कुछ भी हो जाये इस दुनिया \uD83C\uDF0E में, लेकिन दोबारा किसी से सच्चा प्यार \uD83C\uDF39 नही होता।");
        love.add("तेरी मोहब्बत \uD83D\uDC95 ने हमे बेनाम कर दिया, हर ख़ुशी से हमे अंजान \uD83D\uDE0C कर दिया, हमने तो नही चाहा था हमे भी मोहब्बत ♥️ हो, लेकिन तेरी पहली नज़र \uD83D\uDC40 ने मुझे नीलाम कर दिया।");
        love.add("अगर तुम न होते तो गजल कौन \uD83D\uDDE3️ कहता, तुम्हारे\n" +
                "चहरे \uD83D\uDE09 को कमल कौन कहता, ये तो करिश्मा है मोहब्बत \uD83E\uDDE1 का, वरना पत्थर\uD83D\uDD39 को ताजमहल कौन कहता।");
        love.add("जिंदगी एक लहर \uD83C\uDF0A थी फिर आप हासिल हुए, न जाने कैसे हम आपके काबिल हुए, न भूल पाएंगे कभी उस हंसी पल को, जब आप हमारी जिंदगी में शामिल हुए।");
        love.add("तू ही मेरी जिंदगी \uD83E\uDDE1 तू ही मेरा ख्वाब \uD83D\uDCAD है, तू ही सादगी तू ही एहसास \uD83D\uDE41 है, जी चाहता है बस यही कहता रहूँ, तू ही मेरी मन्नत तू ही मेरी जान ♥️ है।");
        love.add("न जाने क्यों वो हमसे मुस्कुरा ☺️ कर मिलते हैं, अंदर के सारे गम छुपा ♥️ कर मिलते हैं, वो जानते हैं शायद नजरे \uD83D\uDC40 सच बोलती हैं, इसलिये वो हमसे नजरे झुका \uD83E\uDDE1 कर मिलते हैं।");
        love.add("बहारें जब खिलती हैं तो फूल \uD83C\uDF3B खिल जातें हैं,\n" +
                "और जब इश्क जवां होता है तो दो दिल ♥️ मिल जाते हैं, इश्क की राहें भी बहुत अजीब \uD83D\uDC95 होती हैं, लफ्ज आँखों \uD83D\uDC40 से बयां होते हैं, और होठ \uD83E\uDD2B सिल जाते हैं।");
        love.add("मोहब्बत \uD83E\uDDE1 तो जीने का नाम है, मोहब्बत \uD83D\uDC98 तो यूँ ही बदनाम है, एक बार मोहब्बत \uD83C\uDF39 कर के तो देखो,\n" +
                "मोहब्बत \uD83D\uDC94 हर दर्द पिने का नाम है।");
        love.add("तेरे साय को दिल \uD83D\uDC9D में छुपाये चलते हैं, तेरी यादो को दिल \uD83D\uDC97 में दबाय चलतें हैं, जिस दिन न हो उन से मुलाकात \uD83D\uDC92, उस दिन सांसो \uD83D\uDE41 के गुल मुरझाय चलतें हैं।");
        love.add("उसकी झील सी आँखों \uD83D\uDC40 में डूब जाने को दिल ♥️ करता है, उसके इश्क में तबाह \uD83D\uDC94 हो जाने को दिल \uD83E\uDDE1 करता है, कदम बहक रहे हैं और दिल \uD83D\uDC95 धड़क रहा है,\n" +
                "उसके दीदार में मिट \uD83C\uDF39 जाने का जी चाहता है।");
        love.add("कभी तुझे धोखा नही देंगे हम पर कुछ एतवार तो करो, जरा मेरी तरह अपना दिल \uD83E\uDDE1 बेकरार तो करो, जब तूम सामने होती हो तो जिंदगी में एक रौशनी \uD83D\uDCA1 सी होती है, एक बार मेरी तरह मुझे तुम प्यार \uD83D\uDC9D तो करो।");
        love.add("मोहब्बत \uD83D\uDC97 में अच्छा खासा इंसान दीवाना ♥️ बन जाता है, बिना कुछ सोचे समझे फ़साना बन जाता है, उनसे एक नजर \uD83D\uDC40 क्या मिली हमारे होश उड़ \uD83E\uDD2A गये,\n" +
                "न जाने कैसे कोई किसी की जान \uD83E\uDD7A बन जाता है।");
        love.add("देख कर तुम्हारे बहते आँसू, हम सह नही सकते हैं, न जाने तुमसे हमे कितनी मोहब्बत हैं हम कह नही सकते हैं, कितना भी नाराज हो जाएं हम तुमसे\n" +
                "ऐ सनम, लेकिन ये भी सच हैं हम तुम्हारे बिना रह नही सकते हैं।");
        love.add("अपनी कलम से लिखूं वो लफ़्ज़ हो तुम, अपने दिमाग से सोच लूँ वो ख्याल हो तुम, अपनी दुआओ\n" +
                "में मांग लूँ वो मन्नत हो तुम, और जिसे हम अपने दिल में रखते हैं वो चाहत हो तुम।");
        love.add("भंवर से निकल कर एक किनारा मिला है, जीने को फिर एक सहारा मिला है, बहुत कश्मकश में थी\n" +
                "ये जिंदगी मेरी, अब इस जिंदगी में साथ तुम्हारा मिला है।");
        love.add("नज़रो को तेरे प्यार से इंकार नही है, अब मुझे किसी और का इंतज़ार नही है, मैं खामोश हूँ तो वो वजूद है मेरा, लेकिन तुम ये न समझना मुझे तुमसे प्यार नही है।");
        love.add("क्यों किसी से इतना प्यार हो जाता है, एक दिन का भी इंतज़ार दुष्वार हो जाता है, अपने भी लगने लगते हैं पराये, जब एक अजनबी पर एतवार हो जाता है।");
        love.add("कोई चाँद से मोहब्बत करता है, कोई सूरज से मोहब्बत करता है, हम उनसे मोहब्बत करते हैं, जो\n" +
                "हमसे मोहब्बत करता है। ");
        love.add("हर पर्वत को झुका नही सकते, हर दरिया को\n" +
                "सुखा नही सकते, तुम हमे भूल जाओ भले ही, लेकिन हम तुम्हे कभी भुला नही सकते।");
        love.add("इस प्यार का अंदाज़ न जाने कैसा है, हम क्या बताये ये राज़ कैसा है, कौन कहता है आप चाँद जैसे हो, हम तो कहते हैं की चाँद खुद आप जैसा है।");
        love.add("दो बातें उनसे की तो दिल का दर्द खो गया, लोगो ने हमसे पूछा तुमको क्या हो गया, हम तो बस यूँ ही मुस्कुरा कर रह गये, अब कैसे कह हमे भी किसी से प्यार हो गया।");
        love.add("मैं यूँ मिलूँ तुझसे की तेरा लिबास बन जाऊँ, तुझे बना कर समंदर खुद प्यास बन जाऊँ, आज पहलू में टूट कर बिखर जाऊँ, कल को शायद मुमकिन नही हो मैं तुझको पाऊँ।");
        love.add("मेरे बजूद में काश तू उतर जाए, मैं देखूं आईना\n" +
                "और तू नज़र आये, तू हो सामने और ये वक्त ठहर जाए, और ये जिंदगी तुझे देखते हुए गुज़र जाए।");
        love.add("सफर वही तक जहाँ तक तुम हो, नज़र वही तक\n" +
                "जहाँ तक तुम हो, वैसे तो हज़ारों फूल खिलतें हैं गुलशन में मगर, खुशबू वही तक जहाँ तक तुम हो। ");
        love.add("किसी ने पूछा इश्क हुआ था क्या? हमने मुस्कुरा कर कहा आज भी है।");
        love.add("चुपके से आकर मेरे दिल में उतर जाते हो, सांसो में मेरी खुशबू बन कर बिखर जाते हो, कुछ यूँ\n" +
                "चला है तेरे इश्क का जादू, सोतें जागते अब तो तुम ही तुम नज़र आते हो।");
        love.add("किसी मोड़ पर उसका दीदार हो जाये, काश उसे भी मुझ पर एतवार हो जाये, उसकी पलके झुकें और इकरार हो जाये, काश उसे भी मुझ से प्यार हो जाये।");
        love.add("हम भी अब मोहब्बत के गीत गाने लगे हैं, जब से वो हमारे ख्वाबों में आने लगे हैं।");
        love.add("तुझ पर एतवार करना हैं,\n" +
                "दिल जान से प्यार करना है,\n" +
                "मेरी ख्वाइश ज्यादा नही बस इतनी हैं,\n" +
                "तुझे हर लम्हे में अपना बना कर रखना है।");
        love.add("एहसास के दामन में आंसू गिरा कर देखो,\n" +
                "प्यार कितना है कभी हमे आज़मा कर देखो,\n" +
                "बिछड़ कर तुमसे क्या होगी दिल की हालत,\n" +
                "कभी किसी आईने पर पत्थर गिरा कर देखो।");
        love.add("अपनी मोहब्बत से सजाना है तुझको, कितनी चाहत है तुझसे ये बताना है तुझको, राहों में तेरी बिछाकर मोहब्बत अपनी, इश्क के सफर पर ले जाना है तुझको। ");
        love.add("मोहब्बत की शमा जला कर तो देखो, ये दिलो की दुनिया सज़ा कर तो देखो, तुझे हो न जाए मोहब्बत तो कहना, ज़रा हमसे नजरे मिला कर देखो।");
        love.add("हर एक हसीन चहरे में गुमान उसका था,\n" +
                "वस सका न इस दिल कोई क्योंकि ये मकान उसका था,\n" +
                "मिट गया हर एक गम मेरे दिल से,\n" +
                "लेकिन जो मिट न सका मेरे दिल से वो नाम उसका था।");
        love.add("आँखों के सामने हमने हर पल आपको ही पाया है, हमने तो हर पल इस दिल में बस आपको ही बसाया है, हम आपके बिना जिए भी तो कैसे, क्या कोई अपनी जान के बिना भी जी पाया है।");
        love.add("अगर कभी उदास हो जाओ तो मेरे हँसी मांग लेना,\n" +
                "अगर कभी कोई गम आपके पास आये तो मेरी ख़ुशी मांग लेना,\n" +
                "खुदा आपको लम्बी उम्र दे जीने के लिए,\n" +
                "अगर एक पल भी कम पड़े तो मेरी\n" +
                "मेरी जिंदगी मांग लेना।");
        System.out.println("Love " + love.size());

        dosti = new ArrayList<>();
        dosti.add("आसमान से तोड़ कर सितारा दिया है,\n" +
                "आलम-ए-तन्हाई में एक सहारा दिया है,\n" +
                "मेरी किस्मत भी नाज़ करती है मुझपे,\n" +
                "खुदा ने दोस्त ही इतना प्यारा दिया है।");

        dosti.add("हम जब भी आपकी दुनिया से जायेंगे,\n" +
                "इतनी खुशियाँ और अपनापन दे जायेंगे,\n" +
                "कि जब भी याद करोगे इस पागल दोस्त को,\n" +
                "हँसती आँखों से आँसू निकल आयेंगे।");
        dosti.add("दोस्ती एक वो एहसास होता है,\n" +
                "जो अनजाने लोगो को भी पास लाता है,\n" +
                "जो हर पल साथ दे वही दोस्त कहलाता है,\n" +
                "वरना तो अपना साया भी साथ छोड़ जाता है।");
        dosti.add("सच्चा दोस्त वही होता है जो हमे कभी गिरने न दे,\n" +
                "वो न कभी किसी की नज़रो में गिरने दे,\n" +
                "और न कभी किसी के कदमो में गिरने दे।");
        dosti.add("ज़िन्दगी के कुछ उलझे सवालो से डर लगता है,\n" +
                "ज़िन्दगी में दिल की तन्हाइयो से डर लगता है,\n" +
                "ज़िन्दगी में एक सच्चा दोस्त तो मिल पाना मुश्किल होता है,\n" +
                "पर एक सच्चे दोस्त को खोने से डर लगता है। ");
        dosti.add("तेरी दोस्ती में ज़िन्दगी में तूफान मचाएंगे,\n" +
                "तेरी दोस्ती में दिल के अरमान सजायेंगे,\n" +
                "अगर तेरी दोस्ती ज़िन्दगी भर साथ दे,\n" +
                "तो हम दोस्ती में मौत को भी पीछे छोड़ जायेंगे। ");
        dosti.add("अगर बात दिल से कही गई हो तो वो दिल को छू लेती है,\n" +
                "और कुछ बिन कही बात भी कुछ कह देती है,\n" +
                "कुछ लोग तो दोस्ती का मतलब ही बदल देते है,\n" +
                "और कुछ की तो दोस्ती से ही ज़िन्दगी बदल जाती है।");
        dosti.add("ज़िन्दगी इतिहास फिर नही दोहराती,\n" +
                "हर पल हर मोड़ पर है दोस्तों की याद आती,\n" +
                "ज़िन्दगी दोस्ती के लम्हो में है गुम हो जाती,\n" +
                "उन लम्हो को सोच कर हमारी आँखे हैं नम हो जाती।");
        dosti.add("अच्छा और सच्चा दोस्त एक फूल है,\n" +
                "जिसे हम तोड़ भी नही सकते,\n" +
                "और अकेला छोड़ भी नही सकते,\n" +
                "अगर तोड़ लिया तो मुरझा जायेगा,\n" +
                "और छोड़ दिया तो कोई और ले जायेगा।");
        dosti.add("ज़िन्दगी के सारे गम क्यों बाँट लेते हैं दोस्त,\n" +
                "क्यों ज़िन्दगी में साथ देते हैं दोस्त,\n" +
                "रिश्ता तो सिर्फ उनसे दिल का होता है जी,\n" +
                "फिर भी क्यों हमे अपना मान लेते हैं दोस्त।");
        dosti.add("जब दोस्ती सच्ची और मजबूत होती है,\n" +
                "तो उसे जताने की ज़रूरत नही होती है,\n" +
                "चाहे दोस्त कितना भी दूर चला जाये,\n" +
                "उसे पास लाने की ज़रूरत नही होती है।");
        dosti.add("दोस्ती वो नही जो मिट जाये,\n" +
                "रास्तो की तरह कट जाये,\n" +
                "दोस्ती तो वो प्यारा एहसास है,\n" +
                "जिसमे सब कुछ पल भर में ही सिमट जाये।");
        dosti.add("उत्साह की परछाइयों का नाम है जिंदगी, दुखों की गहराईओं का नाम है जिंदगी, एक प्यारा सा दोस्त है हमारा यहाँ, उसकी प्यारी सी खुशी का नाम है जिंदगी। ");
        dosti.add("दुख बहुत होगा जब हम छोड़ के जाएंगे, तड़पोगे बहुत मगर आँसू नहीं आएँगे, जब साथ कोई ना दे तो हमें पुकार लेना ऐ दोस्त, आसमां पर होंगे तो भी लौट के आएंगे।");
        dosti.add("जब साथ बिताया समय याद आता है, मेरी आंखों में आंसू छोड़ जाता है, कोई और मिल जाये तो हमें न भूल जाना, दोस्ती का रिश्ता जिंदगी भर काम आता है।");
        dosti.add("तू मिला नही है हमसे पर पास भी है, हमे तेरी कमी का अहसास भी है, दोस्त तो हमारे लाखों हैं इस जहाँ में, पर तू कमीना भी है और खास भी है।");
        dosti.add("दिल ही क्या जो मिलने की आरजू न करे, तुम्हें भूलकर जियूं यह खुदा न करे, रहे तेरी दोस्ती मेरी जिंदगी बनकर, यह बात और है जिन्दगी वफा न करे।");
        dosti.add("आग तो तूफान में भी जल जाती हैं, पुष्प तो काँटो में भी खिल जाते हैं, मस्त बहुत होती हैं वो शाम, दोस्त आप जैसे जहां मिल जाते हैं।");
        dosti.add("संग रहते यूँ ही समय निकल जायेगा, तन्हाइयों में होने के बाद कौन किसके बारे में सोच के याद आयेगा, जी लो इस पल को जब हम साथ हैं यारों, कल क्या पता वक़्त कहाँ ले के जायेगा।");
        dosti.add("चाँद की दूरी एक रात तक है, सूरज की दूरी बस दिन तक है, हम दोस्ती में वक़्त नहीं देखते, क्यूंकि हमारी दोस्ती की हद हमारी आखिरी साँस तक है।");
        dosti.add("दोस्ती वो नहीं जो जान देती है, दोस्ती वो भी नहीं जो ख़ुशी देती है, दोस्तों, सच्ची दोस्ती तो वो है, जो पानी में गिरा हुआ दोस्त का आंसू भी पहचान लेती है।");
        dosti.add("दोस्ती तो एक झोंका है हवा का, दोस्ती तो एक नाम है वफा का, दूसरों के लिए चाहे कुछ भी हो, हमारे लिए तो खुदा का हसीन तोहफा है दोस्ती का।");
        dosti.add("कामयाबी हमेशा हौसलों से मिलती है, हौसले हमेशा दोस्तों से मिलते हैं, अच्छे दोस्त मुश्किल से मिलते हैं, और आप जैसे दोस्त नसीब से मिलते हैं।");
        dosti.add("तुझे टूटा हुआ देखकर ऐ दोस्त, मैं खुद भी टूट जाता हूँ, इसलिए तुझे समझाता हूँ, और अकेले मैं रोने बैठ जाता हूँ।");
        dosti.add("दोस्ती का वो पुराना पल याद आता है, मेरी आँखों को भर जाता है, तेरी दोस्ती सदा जिंदा रहे, यही हमारा दिल चाहता है।");
        dosti.add("जिंदगी के सफर मे हम गरीब क्या हुए, वो दोस्त भी साथ छोड़ गए जो कभी करीब हुए, जिंदगी भर साथ रहने की जो कसम खाते थे, आज वो हमें बीच राह में छोड़के अनक़रीब हुए।");
        dosti.add("ज़िंदगी में बहुत मुश्किले हैं, पर हर कोई सहारा अपना नहीं होता, ज़िंदगी में बहुत दोस्त हैं, पर हर कोई ख़ास हमारा नहीं होता, पर जब से आप जैसा दोस्त मिला है, और किसी को ख़ास बनाना गवारा नही होता।`");
        dosti.add("जुबान पे उल्फत के अफसाने नहीं आते, जो बीत गए फिर से वो फसाने नहीं आते, यार ही होते हैं यारो के हमदर्द, कोई फ़रिश्ते यहाँ साथ निभाने नहीं आते।");
        dosti.add("दोस्ती में दोस्त, दोस्त का ख़ुदा होता है,\n" +
                "महसूस तब होता है जब वो जुदा होता है।");
        dosti.add("ना तुम दूर जाना ना हम दूर जायेंगे,\n" +
                "अपने-अपने हिस्से की दोस्ती निभाएंगे।");
        dosti.add("हम जब भी आपकी दुनिया से जायेंगे,\n" +
                "इतनी खुशियाँ और अपनापन दे जायेंगे,\n" +
                "कि जब भी याद करोगे इस पागल दोस्त को,\n" +
                "हँसती आँखों से आँसू निकल आयेंगे।");
        dosti.add("दोस्ती नाम है सुख-दुःख की कहानी का,\n" +
                "दोस्ती राज है सदा ही मुस्कुराने का,\n" +
                "ये कोई पल भर की जान-पहचान नहीं है,\n" +
                "दोस्ती वादा है उम्र भर साथ निभाने का।");
        dosti.add("आदतें अलग हैं मेरी दुनिया वालों से,\n" +
                "दोस्त कम रखता हूँ पर लाजवाब रखता हूँ।");
        dosti.add("सच्चे दोस्त हमें कभी गिरने नहीं देते,\n" +
                "न किसी कि नजरों मे न किसी के कदमों में।");
        dosti.add("खामोशियों में धीमी सी आवाज़ है,\n" +
                "तन्हाईयों में भी एक गहरा राज़ है,\n" +
                "मिलते नही हैं सबको अच्छे दोस्त यहाँ,\n" +
                "आप जो मिले हो हमें खुद पर नाज़ है।");
        dosti.add("यादों के भंवर में एक पल हमारा हो,\n" +
                "खिलते चमन में एक गुल हमारा हो,\n" +
                "जब याद करें आप अपने दोस्तों को,\n" +
                "उन नामों में बस एक नाम हमारा हो।");
        dosti.add("तूफानों \u200Bकी दुश्मनी से न बचते तो खैर थी\u200B,\n" +
                "\u200Bसाहिल से दोस्तों के भरम ने डुबो दिया\u200B।");
        dosti.add("दोस्ती किस से न थी किस से मुझे प्यार न था,\n" +
                "जब बुरे वक़्त पे देखा तो कोई यार न था।");
        dosti.add("जो दिल के हो करीब उसे रुसवा नहीं करते,\n" +
                "यूँ अपनी दोस्ती का तमाशा नहीं करते,\n" +
                "खामोश रहोगे तो घुटन और बढ़ेगी,\n" +
                "अपनों से कोई बात छुपाया नहीं करते।");
        dosti.add("एहसास बहुत होगा जब छोड़ के जाएंगे,\n" +
                "रोयेंगे बहुत मगर आँसू नहीं आएँगे,\n" +
                "जब साथ कोई ना दे तो आवाज़ हमें देना,\n" +
                "आसमान पर होंगे तो भी लौट के आएंगे।");
        dosti.add("वक्त की यारी तो हर कोई करता है मेरे दोस्त,\n" +
                "मजा तो तब है जब वक्त बदले पर यार ना बदले।");
        dosti.add("देखी जो नब्ज मेरी तो हँस कर बोला हकीम,\n" +
                "तेरे मर्ज़ का इलाज महफ़िल है तेरे दोस्तों की।");
        dosti.add("आपकी हमारी दोस्ती सुरों का साज है,\n" +
                "आप जैसे दोस्त पर हमें नाज़ है,\n" +
                "अब चाहे कुछ भी हो जाये जिंदगी में,\n" +
                "दोस्ती वैसे ही रहेगी जैसे आज है।");
        dosti.add("करनी है खुदा से गुजारिश,\n" +
                "तेरी दोस्ती के सिवा कोई बंदगी न मिले,\n" +
                "हर जनम में मिले दोस्त तेरे जैसा,\n" +
                "या फिर कभी जिंदगी न मिले।");
        dosti.add("सच्ची है मेरी दोस्ती आजमा के देखलो,\n" +
                "करके यकीं मुझ पे मेरे पास आ के देखलो.\n" +
                "बदलता नहीं कभी सोना अपना रंग,\n" +
                "जितनी बार चाहे आग लगा कर देखलो।");
        dosti.add("तुम सदा मुस्कुराते रहो ये तमन्ना है हमारी,\n" +
                "हर दुआ में माँगी है बस खुशी तुम्हारी,\n" +
                "तुम सारी दुनिया को दोस्त बना कर देख लो,\n" +
                "फ़िर भी महसूस करोगे कमी हमारी।");
        dosti.add("साथ अगर दोगे तो मुस्कुराएंगे ज़रूर,\n" +
                "प्यार अगर दिल से करोगे तो निभाएंगे ज़रूर,\n" +
                "कितने भी काँटे क्यों ना हों दोस्ती की राहों में,\n" +
                "आवाज़ अगर दिल से दोगे तो आएंगे ज़रूर।");
        dosti.add("दिए तो आँधी में भी जला करते हैं,\n" +
                "गुलाब तो काँटो में भी खिला करते हैं,\n" +
                "खुशनसीब बहुत होती है वो शाम,\n" +
                "दोस्त आप जैसे जब मिला करते हैं।");
        dosti.add("लोग कहते हैं ज़मीं पर किसी को खुदा नहीं मिलता,\n" +
                "शायद उन लोगों को दोस्त कोई तुम-सा नहीं मिलता।");
        dosti.add("किस्मत वालों को ही मिलती है पनाह किसी के दिल में,\n" +
                "यूं हर शख़्स को तो जन्नत का पता नहीं मिलता।");
        dosti.add("गुनाह करके सजा से डरते है,\n" +
                "ज़हर पी के दवा से डरते है,\n" +
                "दुश्मनो के सितम का खौफ नहीं हमे,\n" +
                "हम दोस्तों के खफा होने से डरते है।");
        dosti.add("एक रात रब ने मेरे दिल से पूछा,\n" +
                "तू दोस्ती में इतना क्यूँ खोया है?\n" +
                "दिल बोला दोस्तों ने ही दी हैं सारी खुशियाँ,\n" +
                "वरना प्यार करके तो दिल हमेशा रोया है।");
        dosti.add("चंद लम्हों की जिंदगानी है,\n" +
                "नफरतों से जिया नहीं करते,\n" +
                "दुश्मनों से गुजारिश करनी पड़ेगी,\n" +
                "दोस्त तो अब याद किया नहीं करते।");
        dosti.add("हर ख़ुशी से ख़ूबसूरत तेरी शाम कर दूँ,\n" +
                "अपना प्यार और दोस्ती तेरे नाम कर दूँ,\n" +
                "मिल जाये अगर दुबारा यह ज़िन्दगी दोस्त,\n" +
                "हर बार मैं ये ज़िन्दगी तुझ पर कुर्बान कर दूँ।");
        dosti.add("दुनियादारी में हम थोड़े कच्चे हैं,\n" +
                "पर दोस्ती के मामले में सच्चे हैं,\n" +
                "हमारी सच्चाई बस इस बात पर कायम है,\n" +
                "कि हमारे दोस्त हमसे भी अच्छे हैं।");
        dosti.add("दोस्त समझते हो तो दोस्ती निभाते रहना,\n" +
                "हमें भी याद करना खुद भी याद आते रहना,\n" +
                "हमारी तो हर ख़ुशी दोस्तों से ही है,\n" +
                "हम खुश रहें या ना आप यूँ ही मुस्कुराते रहना।");
        dosti.add("इश्क़ और दोस्ती मेरी ज़िन्दगी के दो जहाँ है,\n" +
                "इश्क़ मेरा रूह तो दोस्ती मेरा ईमान है,\n" +
                "इश्क़ पे कर दूँ फ़िदा अपनी सारी ज़िन्दगी,\n" +
                "मगर दोस्ती पे तो मेरा इश्क़ भी कुर्बान है।");
        dosti.add("दोस्ती दर्द नहीं खुशियों की सौगात है,\n" +
                "किसी अपने का ज़िंदगी भर का साथ है,\n" +
                "ये तो दिलों का वो खूबसूरत एहसास है,\n" +
                "जिसके दम से रौशन ये सारी कायनात है।");
        System.out.println("Dosti " + dosti.size());


        zindagi = new ArrayList<>();
        zindagi.add("सबके लबो पर एक दिन तेरा ही नाम होगा,\n" +
                "हर कदम पे तेरे, दुनिया का सलाम होगा,\n" +
                "हर मुसीबत का सामना करना तू डट कर,\n" +
                "देखना समय एक दिन तेरा भी गुलाम होगा।");
        zindagi.add("साहिल के सुकूँ से किसे इंकार है लेकिन,\n" +
                "तूफ़ान से लड़ने में मज़ा ही कुछ और है।");
        zindagi.add("सिर्फ सांसे चलते रहने को ही ज़िन्दगी नही कहते\n" +
                "आँखों में कुछ ख़वाब और दिल में उम्मीदे होना जरूरी है ");
        zindagi.add("मुझे ज़िन्दगी का इतना तजुर्बा तो नही\n" +
                "पर सुना है सादगी में लोग जीने नही देते ");
        zindagi.add("ज़िन्दगी में ऐसे लोग भी होते है\n" +
                "जिन्हें हम प् नही सकते सिर्फ चाह सकते है ");
        zindagi.add("ज़िन्दगी कभी आसन नही होती इसे आसान करना पड़ता है\n" +
                "कुछ नजर अंदाज करके कुछ को बर्दास्त करके ");
        zindagi.add("मत सोच इतना ज़िन्दगी के बारे में\n" +
                "जिसने ज़िन्दगी दी है उसने भी कुछ तो सोचा होगा ");
        zindagi.add("ज़िन्दगी कबकी खामूश हो गयी, दिल तो बस आदतन धड़कता है. ");
        zindagi.add("ज़िन्दगी हसीन है , ज़िन्दगी से प्यार करो\n" +
                "हो रात तो सुबह का इंतज़ार करो\n" +
                "वो पल भी आएगा, जिस पल का इंतज़ार हैं आपको\n" +
                "बस रब पर भरोसा और वक़्त पे ऐतबार करो");
        zindagi.add("वही करता और वही करवाता है ,\n" +
                "\n" +
                "क्यू  बंदे  तू  इतराता  है ।\n" +
                "\n" +
                "इक साँस भी नही है तेरे बस की ,\n" +
                "\n" +
                "वही  सुलाता  और  जगाता  है");
        zindagi.add("रखा करो नजदीकियॉ.....\n" +
                "जिन्दगी का कुछ भरोसा नही....\n" +
                "\n" +
                "फिर मत कहना....\n" +
                "चले भी गऐ और बताया भी नही....!\n");
        zindagi.add("फूलों की शुरुआत कली से होती है;\n" +
                "\n" +
                "जिंदगी की शुरुआत प्यार से होती है;\n" +
                "\n" +
                "प्यार की शुरुआत अपनों से होती है;\n" +
                "\n" +
                "और अपनों की शुरुआत आप से होती है!");
        zindagi.add("ये सोच कर अपनी हर हँसी बाट दी मेने\n" +
                "\n" +
                "कि किसी ख़ुशी पर मेरा भी नाम हो जाए:\n" +
                "\n" +
                "मुख़्तसर सा सफर है मेरा कोन जाने कब\n" +
                "\n" +
                "मेरे इस सफर की आखरी शाम हो जाए");
        zindagi.add("हाथ की लकीरे भी कितनी अजीब है \n" +
                "\n" +
                "कमबख्त मुट्ठी में तो है पर काबू में नहीं ");
        zindagi.add("ज़िन्दगी एक फूल है तो मोहब्बत उसकी खुशबू \n" +
                "\n" +
                "प्यार एक दरिया है तो महबूब उसका साहिल \n" +
                "\n" +
                "अगर ज़िन्दगी एक दर्द है तो दोस्त उसकी दवा ");
        zindagi.add("खूबसूरत सा एक पल किस्सा बन जाता है !\n" +
                "\n" +
                "जाने कब कौन ज़िंदगी का हिस्सा बन जाता है !\n" +
                "\n" +
                "कुछ लोग ज़िंदगी में मिलते हैं ऐसे !\n" +
                "\n" +
                "जिनसे कभी ना टूटने वाला रिश्ता बन जाता है !!");
        zindagi.add("Zindgi Bahut Kuch Sikhati Hai,\n" +
                "\n" +
                "Thoda Rulati Thoda Hasti Hai,\n" +
                "\n" +
                "Khud Se Jyada Kisi Par Bharosha Mat Karna,\n" +
                "\n" +
                "Kyoki Andhere Me Parchai Bhi Sath Chhod Jati Hai");
        zindagi.add("जी भर के रोते है तो करार मिलता है \n" +
                "\n" +
                "इस जहाँ में कहा सबको प्यार मिलता है \n" +
                "\n" +
                "ज़िन्दगी गुज़र जाती है इम्तिहान के दौर में\n" +
                "\n" +
                "एक ज़ख्म भरता है तो दूसरा तैयार मिलता है !!");
        zindagi.add("मालूम है मुझे वो ना मेरी थी ना कभी होगी !\n" +
                "\n" +
                "बस इक शौक था उसके \"पीछे \"जिदंगी बर्बाद करने कI !!");
        zindagi.add("तुमसे किसने कह दिया कि मुहब्बत की बाजी हार गए हम !\n" +
                "\n" +
                "अभी तो दाँव मे चलने के लिए मेरी जान बाकी है !!");
        zindagi.add("लोग कहते हैं दुःख बुरा होता है !\n" +
                "\n" +
                "जब भी आता है रुलाता है !\n" +
                "\n" +
                "मगर हम कहते हैं दुःख अच्छा होता है !\n" +
                "\n" +
                "जब भी आता है कुछ सिखाता है !!");
        zindagi.add("जिन्दगी का सबसे बड़ा रहस्य यह है की..\n" +
                "\n" +
                "हम जानते है कि हम किसके लिए जी रहे है !\n" +
                "\n" +
                "लेकिनये कभी नहीं जान पाते ,,,\n" +
                "\n" +
                "कि हमारे लिए कौन जी रहा हैं !!");
        zindagi.add("Dil Me Khushiyo Ki Aahat Rakhna\n" +
                "Zindagi Me Jeetne Ki Chahat\n" +
                "Rakhna Aur Kya Doge Hamein Koi\n" +
                "Tohfa Bas Apne Hotho Pe Yuhi\n" +
                "Muskurahat Rakhna..");
        zindagi.add("तेरी धड़कन ही ज़िंदगी का किस्सा है मेरा,\n" +
                "\n" +
                "तू ज़िंदगी का एक अहम् हिस्सा है मेरा..\n" +
                "\n" +
                "मेरी मोहब्बत तुझसे, सिर्फ़ लफ्जों की नहीं है,\n" +
                "\n" +
                "तेरी रूह से रूह तक का \u202A\u200Eरिश्ता\u202C है मेरा..!!");
        zindagi.add("कोई मुझसे पूछता है जब मेरी जिंदगी की\n" +
                "कीमत\n" +
                "मुझे याद आ जाता है तेरा वो हल्का सा\n" +
                "मुस्कराना");
        zindagi.add("कैसे कहें कि ज़िंदगी क्या देती है; \n" +
                "हर कदम पे ये दगा देती है; \n" +
                "जिनकी जान से भी ज्यादा कीमत हो दिल में; \n" +
                "उन्ही से दूर रहने की सज़ा देती है।");
        zindagi.add("जिंदगी के मजे लेना सीखो !\n" +
                "\n" +
                "वक्त तो तुम्हारे मजे लेता ही रहेग !!");
        zindagi.add("जिंदगी\u202C में बेशक हर मौके का फायदा उठाओ !\n" +
                "\n" +
                "मगर किसी के हालात और मजबूरी का नही !!");
        zindagi.add("Tum khafa ho gaye to koi khushi na rahegi,\n" +
                "\n" +
                "Tere bina chirago mein roshni na rahegi,\n" +
                "\n" +
                "Kya kahe kya guzregi dil par,\n" +
                "\n" +
                "Zinda to rahenge par zindagi na rahegi.");
        zindagi.add("Tum meri zindagi ka wo adhura kissa ho \n" +
                "\n" +
                "Jiske pure hone ka intzar aj bhi hai mujhe\n" +
                "\n" +
                "Janti hu vaham hai ye mera\n" +
                "\n" +
                "Phir bhi na jane kyu tere laut aane ka intzar aj bhi hai mujhe");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("");
        zindagi.add("समंदर न सही पर एक नदी तो होनी चाहिए,\n" +
                "तेरे शहर में ज़िंदगी कहीं तो होनी चाहिए।");
        zindagi.add("इक टूटी-सी ज़िंदगी को समेटने की चाहत थी,\n" +
                "न खबर थी उन टुकड़ों को ही बिखेर बैठेंगे हम।");
        zindagi.add("ले दे के अपने पास फ़क़त एक नजर तो है,\n" +
                "क्यूँ देखें ज़िंदगी को किसी की नजर से हम।");
        zindagi.add("बेहतर से बेहतर कि तलाश करो,\n" +
                "मिल जाये नदी तो समंदर कि तलाश करो,\n" +
                "टूट जाता है शीशा पत्थर कि चोट से,\n" +
                "टूट जाये पत्थर ऐसा शीशा तलाश करो।");
        zindagi.add("रो कर मुस्कुराने का मजा ही कुछ और है,\n" +
                "जिंदगी में कुछ खो कर पाने का मजा ही कुछ और है,\n" +
                "ज़िन्दगी में हार और जीत तो लगी ही रहती है,\n" +
                "लेकिन हार के जीतने का मजा ही कुछ और है।");
        zindagi.add("जिसमे उबाल हो ऐसा खून चाहिये,\n" +
                "जीत के खातिर ऐसा जुनून चाहिए,\n" +
                "ये आसमान भी आएगा ज़मीन पर,\n" +
                "बस इरादों में ऐसी गूंज चाहिये।");
        zindagi.add("सबके लबो पर एक दिन तेरा ही नाम होगा,\n" +
                "हर कदम पे तेरे, दुनिया का सलाम होगा,\n" +
                "हर मुसीबत का सामना करना तू डट कर,\n" +
                "देखना समय एक दिन तेरा भी गुलाम होगा।");
        zindagi.add("Apni zindagi me mujhko karib samajhna,\n" +
                "\n" +
                "Koi gum aaye to sharik samjhna,\n" +
                "\n" +
                "De denge muskurahat aansu ke badle,\n" +
                "\n" +
                "Magar hazaro me thoda aziz samajhna.");
        zindagi.add("हर वक़्त तेरे आने की आस रहती है!\n" +
                "हर पल तुझसे मिलने की प्यास रहती है!\n" +
                "सब कुछ है यहाँ बस तू नही!\n" +
                "इसलिए शायद ये जिंदगी उदास रहती है!\n" +
                "\n");
        zindagi.add("हमें कहाँ मालुम थे इश्क़ के मायने हज़ूर !\n" +
                "\n" +
                "बस वो मिली और जिंदगी मोहब्बत बन गयी !!");
        zindagi.add("जाने क्यूँ अधुरी-सी लगती है जिन्दगी !\n" +
                "\n" +
                "जैसे खुद को किसी के पास भूल आये हो !!");
        zindagi.add("मोहब्बत में लाखों ज़ख्म खाए हमने !\n" +
                "\n" +
                "अफ़सोस उन्हें हम पर ऐतबार नहीं !\n" +
                "\n" +
                "मत पूछो क्या गुजरती है दिल पर !\n" +
                "\n" +
                "जब वो कहते है हमें तुमसे प्यार नहीं !!");
        zindagi.add("कोई दुश्मनी नही ज़िन्दगी से !\n" +
                "\n" +
                "मेरी बस ज़िद्द है तेरे साथ जीना है !!");
        zindagi.add("जब यकीन टूट जाये तो हर रिश्ता बेमानी सा लगता है !\n" +
                "\n" +
                "और जब उम्मीद छूट जाये तो जीना बेकार सा लगता है !!");
        zindagi.add("मेरी ज़िन्दगी का मकसद पूछते है लोग .......\n" +
                "\n" +
                "सुनो बेवजह भी जीते हैं हम जैसे लोग ...!!");
        zindagi.add("ज़िन्दगी में सारा झगड़ा ही ख़्वाहिशों का है,दोस्तों !\n" +
                "ना तो किसी को ग़म चाहिए और ना ही किसी को कम चाहिए !! ");
        zindagi.add("जिंदगी कुछ नहीं बस एक तलब बनकर रह गयी !\n" +
                "न जाने कब अनगिनत टुकडों में बट कर रह गयी !! ");
        zindagi.add("जो जितना दूर होता है नज़रो से\n" +
                "उतना ही वो दिल के पास होता है !\n" +
                "मुस्किल से भी जिसकी एक ज़लक देखने को ना मिले !\n" +
                "वही ज़िंदगी मे सबसे ख़ास होता है !! ");
        zindagi.add("आहिस्ता चल ऐ ज़िंदगी\n" +
                "कुछ क़र्ज़ चुकाने बाकी हैं,\n" +
                "कुछ दर्द मिटाने बाकी हैं\n" +
                "कुछ फ़र्ज़ निभाने बाकी हैं।");
        zindagi.add("ऐ ज़िन्दगी इतने भी दर्द न दे कि मैं बिखर जाऊं,\n" +
                "ऐ ज़िन्दगी इतने भी ग़म न दे कि ख़ुशी भूल जाऊं,\n" +
                "ऐ ज़िन्दगी इतने भी आँसू न दे कि मैं हँसना भूल जाऊं,\n" +
                "इतने भी इम्तिहान न ले कि मैं हार के जीना भूल जाऊं।");
        zindagi.add("वो हर बार अगर चेहरा बदल कर न आया होता,\n" +
                "धोखा मैंने उस शख्स से यूँ न खाया होता,\n" +
                "रहता अगर याद कर मुझे लौट के आती नहीं,\n" +
                "ज़िन्दगी फिर मैंने तुझे यूं न गंवाया होता।");
        zindagi.add("ज़िन्दगी हर हाल में एक मुकाम माँगती है,\n" +
                "किसी का नाम तो किसी से ईमान माँगती है,\n" +
                "बड़ी हिफाजत से रखना पड़ता है दोस्त इसे,\n" +
                "रूठ जाए तो मौत का सामान माँगती हैं।");
        zindagi.add("दुनिया में सैकड़ों दर्दमंद मिलते हैं,\n" +
                "पर काम के लोग चंद मिलते हैं,\n" +
                "जब मुसीबत का वक़्त आता है,\n" +
                "सब के दरवाजे बंद मिलते हैं। ");
        zindagi.add("कदम-कदम पे नया इम्तिहान रखती है,\n" +
                "ज़िन्दगी तू भी मेरा कितना ध्यान रखती है।");
        zindagi.add("जीत भी मेरी और हार भी मेरी,\n" +
                "तलवार भी मेरी और धार भी मेरी,\n" +
                "ज़िन्दगी ये मेरी कुछ यूं सवार है मुझ पर,\n" +
                "डूबी भी मेरी और पार भी मेरी।");
        zindagi.add("शायद यही ज़िंदगी का इम्तिहान होता है,\n" +
                "हर एक शख्स किसी का गुलाम होता है,\n" +
                "कोई ढूढ़ता है ज़िंदगी भर मंज़िलों को,\n" +
                "कोई पाकर मंज़िलों को भी बेमुकाम होता है।");
        zindagi.add("जब रूह किसी बोझ से थक जाती है,\n" +
                "एहसास की लौ और भी बढ़ जाती है,\n" +
                "मैं बढ़ता हूँ ज़िन्दगी की तरफ लेकिन,\n" +
                "ज़ंजीर सी पाँव में छनक जाती है।\n" +
                "\n");
        zindagi.add("कल न हम होंगे न कोई गिला होगा,\n" +
                "सिर्फ सिमटी हुई यादों का सिललिसा होगा,\n" +
                "जो लम्हे हैं चलो हँसकर बिता लें,\n" +
                "जाने कल जिंदगी का क्या फैसला होगा।");
        zindagi.add("एक साँस सबके हिस्से से हर पल घट जाती है,\n" +
                "कोई जी लेता है जिंदगी किसी की कट जाती है।");
        zindagi.add("लोग डूबते हैं तो समंदर को दोष देते हैं,\n" +
                "मंजिल न मिले तो मुकद्दर को दोष देते हैं,\n" +
                "खुद तो संभल कर चल नहीं सकते,\n" +
                "जब ठेस लगती है तो पत्थर को दोष देते हैं।");
        zindagi.add("शुक्रिया ज़िन्दगी...जीने का हुनर सिखा दिया,\n" +
                "कैसे बदलते हैं लोग चंद कागज़ के टुकड़ो ने बता दिया,\n" +
                "अपने परायों की पहचान को आसान बना दिया,\n" +
                "शुक्रिया ऐ ज़िन्दगी जीने का हुनर सिखा दिया।");
        zindagi.add("जिंदगी में ये हुनर भी आजमाना चाहिए,\n" +
                "अपनों से हो जंग तो हार जाना चाहिए।");
        zindagi.add("चेहरे की हँसी से गम को भुला दो,\n" +
                "कम बोलो पर सब कुछ बता दो,\n" +
                "खुद ना रूठो पर सबको हँसा दो,\n" +
                "यही राज है ज़िन्दगी का...\n" +
                "जियो और जीना सिखा दो।");
        zindagi.add("शम्मा परवाने को जलना सिखाती है,\n" +
                "शाम सूरज को ढलना सिखाती है,\n" +
                "क्यों कोसते हो पत्थरों को जबकि...\n" +
                "ठोकरें ही इंसान को चलना सिखाती हैं।");
        zindagi.add("ज़िंदादिली होती है जिन्दगी,\n" +
                "इश्क मे घुली होती है जिन्दगी,\n" +
                "तुमसे मिलने कि चाहत रखती है जिन्दगी,\n" +
                "लेकिन तक़दीर नही मिलने देती है जिन्दगी.");
        zindagi.add("यह ज़िन्दगी बस सिर्फ पल दो पल है,\n" +
                "जिसमें न तो आज और न ही कल है,\n" +
                "जी लो इस ज़िंदगी का हर पल इस तरह,\n" +
                "जैसे बस यही ज़िन्दगी का सबसे हसीं पल है।");
        zindagi.add("खुशी में भी आँखें आँसू बहाती रही,\n" +
                "ज़रा सी बात देर तक रूलाती रही,\n" +
                "\n" +
                "कोई खो के मिल गया तो कोई मिल के खो गया,\n" +
                "ज़िंदगी हम को बस ऐसे ही आज़माती रही।");
        zindagi.add("जीवन की सुबह में कभी सांझ न हो\n" +
                "\n" +
                "जो मिल न सके रब से वो मांग न हो\n" +
                "\n" +
                "खूब चमकें सितारे खुशियों के\n" +
                "\n" +
                "ज़िन्दगी कभी अमावस का चाँद न हो\n" +
                "\n");
        zindagi.add("दो रोज़ तुम मेरे पास रहो.. दो रोज़ मैं तुम्हारे पास रहुं.. चार दिन की ज़िन्दगी है.. ना तुम उदास रहो.. ना मैं उदास रहुं….");
        zindagi.add("कुछ इस तरह फ़कीर ने ज़िन्दगी की मिसाल दी,\n" +
                "मुट्ठी में धूल ली और हवा में उछाल दी !");
        zindagi.add("ज़िन्दगी की जरूरतें समझिए वक्त कम है फरमाइश लम्बी हैं झूठ-सच,जीत- हार की बातें छोड़िये, दास्तान बहुत लम्बी है.");
        zindagi.add("लम्हों की खुली किताब हैं ज़िन्दगी, ख्यालों और सांसों का हिसाब हैं ज़िन्दगी,");
        zindagi.add("ज़िन्दगी की राहों में.. ऐसा अक्सर होता है..\n" +
                "फैसला जो मुश्किल हो वो ही बेहतर होता है..!!");
        zindagi.add("आरज़ू,हसरत,तमन्ना और ख़ुशी कुछ भी नही,\n" +
                "ज़िन्दगी में तू नही तो ज़िन्दगी कुछ भी नही…");
        zindagi.add("मुझे रात दिन ये ख्याल है•वो नज़र से मुझको गिरा ना दें•मेरी ज़िन्दगी का दिया कहीं•ये ग़मो की आंधी बुझा ना दें");
        zindagi.add("पढ़ने वालों की कमी हो गयी है\n" +
                "आज इस ज़माने में...\n" +
                "वरना मेरी ज़िन्दगी का हर पन्ना,\n" +
                "पूरी किताब है।");
        zindagi.add("वही रंजिशें वही हसरतें,\n" +
                "न ही दर्द-ए-दिल में कमी हुई,\n" +
                "है अजीब सी मेरी ज़िन्दगी,\n" +
                "न गुज़र सकी न खत्म हुई।");
        zindagi.add("ज़िंदगी भी तवायफ की तरह होती है,\n" +
                "कभी मजबूरी में नाचती है कभी मशहूरी में।");
        zindagi.add("इतनी बदसलूकी ना कर... ऐ ज़िंदगी,\n" +
                "हम कौन सा यहाँ बार-बार आने वाले हैं।");
        zindagi.add("ज़िन्दगी एक हसीन ख़्वाब है,\n" +
                "जिसमें जीने की चाहत होनी चाहिये,\n" +
                "ग़म खुद ही ख़ुशी में बदल जायेंगे,\n" +
                "सिर्फ मुस्कुराने की आदत होनी चाहिये।");
        zindagi.add("हो के मायूस न यूं शाम से ढलते रहिये,\n" +
                "ज़िन्दगी भोर है सूरज सा निकलते रहिये,\n" +
                "एक ही पाँव पे ठहरोगे तो थक जाओगे,\n" +
                "धीरे-धीरे ही सही राह पे चलते रहिये।");
        zindagi.add("थोड़ी मस्ती थोड़ा सा ईमान बचा पाया हूँ,\n" +
                "ये क्या कम है मैं अपनी पहचान बचा पाया हूँ,\n" +
                "कुछ उम्मीदें, कुछ सपने, कुछ महकती यादें,\n" +
                "जीने का मैं इतना ही सामान बचा पाया हूँ।");
        zindagi.add("है अजीब शहर की ज़िंदगी\n" +
                "न सफर रहा न क़याम है\n" +
                "कहीं कारोबार सी दोपहर\n" +
                "कहीं बदमिजाज़ सी शाम है।");
        zindagi.add("देखा है ज़िंदगी को कुछ इतना करीब से,\n" +
                "चेहरे तमाम लगने लगे हैं अब तो अजीब से।\n" +
                "\n");
        zindagi.add("ज़िन्दगी से पूछिये ये क्या चाहती है,\n" +
                "बस एक आपकी वफ़ा चाहती है,\n" +
                "कितनी मासूम और नादान है ये,\n" +
                "खुद बेवफा है और वफ़ा चाहती है।");
        zindagi.add("मोहब्बत को जी निभाते है उनको मेरे सलाम\n" +
                "और जो छोड़ जाते है बिच रस्ते में उनको मेरा पैगाम\n" +
                "वादे-ए-वफ़ा करो तो फिर फना करो\n" +
                "वरना खुदा लिए किसी की ज़िन्दगी को बर्बाद मत करो");
        zindagi.add(" ये ज़िन्दगी दो दिन की है एक दिन तुम्हारे हक में\n" +
                "और दुसरे दिन तुम्हारे मुखालिफ में\n" +
                "जिस दिन हक में हो उस दिन गुरुर मत करना\n" +
                "और जिस दिन तुम्हारे मुखालिफ हो उस दिन सब्र करना");
        zindagi.add("कुछ बातों का जवाब सिर्फ ख़ामोशी होती है\n" +
                "और यकीन मनो ये बहुत खुबसूरत जवाब होता है");
        zindagi.add("कहा सुना जो भी हो माफ़ करना\n" +
                "कुछ वादे किये ना निभाए हों तो माफ़ करना\n" +
                "कुछ बातें जो हम दोनों के बिच हवी\n" +
                "उन में कुछ भला बुरा हुवा हो तो माफ़ करना\n" +
                "\n");
        zindagi.add("इश्क की नगरी में माफ़ी नहीं किसी को भी\n" +
                "इश्क उमर नहीं देखता बस उजाड़ देता है\n" +
                "\n" +
                "खता हो गई हो तो सजा भी सुना दो\n" +
                "दिल में इतना दर्द क्यू है वजह भी बता दो\n" +
                "देर हो गई याद करने में ज़रूर लेकिन\n" +
                "तुमको भुला देंगे ये ख्याल दिल से निकाल दो");
        zindagi.add("दर्द हो दिल में तो दुवा कीजिये दिल ही जब दर्द हो तो क्या कीजिये\n" +
                "हम को फ़रियाद करनी आती है आप सुनते ही नही तो क्या कीजिये");
        zindagi.add("बस एक माफ़ी तौबा कभी जो इससे सताए तुम को\n" +
                "लो हाथ जुड़े लो कान पकडे अब और कैसे मनाये तुमको\n" +
                "तुम्हारे आते ही इस नगर से हमें तानाफत सी हो गई\n" +
                "में शरारत भी कैसे सह लो के छोड़ रही है हवाएँ भी तुमक");
        zindagi.add("आहिस्ता चल ऐ ज़िंदगी\n" +
                "कुछ क़र्ज़ चुकाने बाकी हैं,\n" +
                "कुछ दर्द मिटाने बाकी हैं\n" +
                "कुछ फ़र्ज़ निभाने बाकी हैं।");
        System.out.println("Zindagi " + zindagi.size());

        funny = new ArrayList<>();
        funny.add("इस दुनिया में लाखों लोग रहते हैं,\n" +
                "कोई हँसता है तो कोई रोता है,\n" +
                "पर सबसे सुखी वही होता है,\n" +
                "जो शाम को दो पैग मार के सोता है।");
        funny.add("उसी दिन से व्हाट्सएप्प से नफरत हो गयी ग़ालिब,\n" +
                "जब बाल कटवाने के लिए एडमिन ने चंदा माँग लिया।\n");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        funny.add("");
        System.out.println("Funny " + funny.size());

        bewafa = new ArrayList<>();
        bewafa.add("अब के अब तस्लीम कर लें तू नहीं तो मैं सही,\n" +
                "कौन मानेगा कि हम में से बेवफा कोई नहीं।");
        bewafa.add("मेरे फन को तराशा है सभी के नेक इरादों ने,\n" +
                "किसी की बेवफाई ने किसी के झूठे वादों ने।");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        bewafa.add("");
        System.out.println("Bewafa " + bewafa.size());

        sad = new ArrayList<>();
        sad.add("जिसके नसीब मे हों ज़माने की ठोकरें,\n" +
                "उस बदनसीब से ना सहारों की बात कर।");
        sad.add("बुला रहा है कौन मुझको उस तरफ,\n" +
                "मेरे लिए भी क्या कोई उदास बेक़रार है।");
        sad.add("वो तेरे खत तेरी तस्वीर और सूखे फूल,\n" +
                "उदास करती हैं मुझ को निशानियाँ तेरी।");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        sad.add("");
        System.out.println("Sad " + sad.size());


        judai = new ArrayList<>();
        judai.add("दिल से निकली ही नहीं शाम जुदाई वाली,\n" +
                "तुम तो कहते थे बुरा वक़्त गुज़र जाता है।");
        judai.add("जुदा हुए हैं बहुत से लोग एक तुम भी सही,\n" +
                "अब इतनी सी बात पे क्या जिंदगी हैरान करें।");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        judai.add("");
        System.out.println("Judai " + judai.size());

        good_morning = new ArrayList<>();
        good_morning.add("सुबह होते ही जब दुनिया आबाद होती है,\n" +
                "आँख खुलते ही दिल में आपकी याद होती है,\n" +
                "खुशियों के फूल हों आपके आँचल में,\n" +
                "ये मेरे होंठों पे पहली फ़रियाद होती है।\n" +
                "सुप्रभात!");
        good_morning.add("सुबह हुयी हवाओं में खुशबु महकी,\n" +
                "प्यारी सी सुबह कर रही है तुम्हारा इंतज़ार,\n" +
                "अब तो जाग जाओ और खोल दो आँखें,\n" +
                "हमारा एस.एम.एस. ले कर आया है ढेर सारा प्यार।");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        good_morning.add("");
        System.out.println("Good Morning " + good_morning.size());

        good_night = new ArrayList<>();
        good_night.add("ऐसा लगता है कुछ होने जा रहा है,\n" +
                "कोई मीठे सपनों में खोने जा रहा है,\n" +
                "धीमी कर दे अपनी रोशनी ऐ चाँद,\n" +
                "मेरा कोई अपना अब सोने जा रहा है।\n" +
                "शुभ रात्रि।");
        good_night.add("जाने कब आपकी आँखों से इजहार होगा,\n" +
                "आपके दिल में हमारे लिए प्यार होगा,\n" +
                "गुजर रही है ये रात आपकी याद में,\n" +
                "कभी तो आपको भी हमारा इंतज़ार होगा।\n" +
                "शुभरात्रि");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        good_night.add("");
        System.out.println("Good Night " + good_night.size());

        birthday = new ArrayList<>();
        birthday.add("आपके जन्मदिन पर हम देते हैं ये दुआ,\n" +
                "खुशियाँ आपके दामन से कभी न हों जुदा,\n" +
                "खुदा की रहमतों में कभी कमी न आये,\n" +
                "आपके होंठों की ये मुस्कराहट न जाए।");
        birthday.add("दुनिया की खुशियाँ आपको मिल जायें,\n" +
                "अपनों से मिलके आपका मन खिल जाये,\n" +
                "चेहरे पर दुःख की कभी शिकन भी न हो,\n" +
                "आपके जन्मदिन पर मेरी दिल से शुभकामनाएं।");
        birthday.add("दिल से मेरी दुआ है कि खुश रहो तुम,\n" +
                "मिले न कोई गम जहाँ भी रहो तुम,\n" +
                "समंदर की तरह दिल है गहरा तुम्हारा,\n" +
                "सदा खुशियों से भरा रहे दामन तुम्हारा।");
        birthday.add("चेहरा आपका खिला रहे गुलाब की तरह,\n" +
                "नाम आपका रोशन रहे आफताब की तरह,\n" +
                "ग़म में भी आप हँसते रहे फूलों की तरह,\n" +
                "अगर हम इस दुनिया में न रहें आज की तरह,\n" +
                "तो भी अपना जन्मदिन मनाते रहना इसी तरह।");
        birthday.add("हो पूरी दिल की हर ख्वाहिश आपके,\n" +
                "और मिले खुशियों का जहां आपको,\n" +
                "अगर आप मांगें आसमां का एक तारा,\n" +
                "तो खुदा दे दे सारा आसमां आपको।\n" +
                "जन्मदिन मुबारक हो।");
        birthday.add("यही दुआ करता हूँ खुदा से,\n" +
                "आपकी जिंदगी में कोई गम न हो,\n" +
                "जन्मदिन पर मिले हजारों खुशियाँ,\n" +
                "चाहे उनमें शामिल हम न हों।");
        birthday.add("जन्मदिन के ये ख़ास लम्हें मुबारक,\n" +
                "आँखों में बसे नए ख्वाब मुबारक,\n" +
                "जिंदगी जो लेकर आई है आपके लिए आज,\n" +
                "वो तमाम खुशियों की हंसीं सौगात मुबारक।\n" +
                "जन्मदिन की शुभकामनाएं।");
        birthday.add("आ तेरी उम्र में लिख दूँ \uD83C\uDF19✨चाँद-सितारों\uD83C\uDF19✨ से,\n" +
                "तेरा जन्मदिन मनाऊँ फूलों से बहारों से…\n" +
                "हर एक खूबसूरती दुनिया \uD83C\uDF0E से मैं ले आउ,\n" +
                "सजाऊ में ये महेफिल हर हसिन नजारों से…\n" +
                "\uD83C\uDF80\uD83C\uDF81जन्मदिन की ढेर सारी शुभकामनायें…\uD83C\uDF82\uD83C\uDF82");
        birthday.add("दोस्त तू है मेरा सबसे न्यारा,\n" +
                "तुझे मुबारक हो तेरा जन्मदिन ओ यारा…\n" +
                "किसी की कभी नजर ना लगे तुझे,\n" +
                "कभी उदास ना हो ये चहेरा प्यारा \uD83D\uDC9E प्यारा…\n" +
                "जन्मदिन \uD83C\uDF82\uD83C\uDF80\uD83C\uDF81 की बहोत बहोत शुभकामनायें");
        birthday.add("≛≛”*•”*•≛≛\n" +
                "दुनिया \uD83C\uDF0E कि सारी खुशियाँ मिले आपको,\n" +
                "खुदा से रहमत और प्यार ❤️ मिले आपको…\n" +
                "आपके होठों पर बनी रहे हमेशा मुस्कान\uD83D\uDE0A,\n" +
                "दुआ \uD83D\uDE4F है,\n" +
                "उम्र के साथ साथ बढ़ते रहे आपका मान-सम्मान…\n" +
                "≛≛”*•”*•≛≛\n" +
                "\uD83C\uDF82\uD83C\uDF82“Happy Birthday”\uD83C\uDF80\uD83C\uDF81\uD83C\uDF82\n" +
                "≛≛”*•”*•≛≛");
        birthday.add("एक दुआ \uD83D\uDE4F माँगते है हम अपने भगवान से,\n" +
                "चाहते है आपकी खुशी पूरे ईमान से,\n" +
                "सब हसरतें पूरी हो आपकी\n" +
                "और आप मुस्कुराएँ दिलो ❤️ जान \uD83D\uDC97 से…\n" +
                "\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81*Happy Birthday*\uD83C\uDF82\uD83C\uDF82");
        birthday.add("मैं लिख दू तुम्हारी उम्र चाँद सितारों से…\n" +
                "मैं मनाऊ जन्मदिन तुम्हारा फूल बहारों से\n" +
                "ऐसी खूबसूरती दुनिया \uD83C\uDF0E से लेकर आऊ मैं\n" +
                "के सारी महफ़िल सज जाए हसीं नजारो से\n" +
                "Happy \uD83C\uDF82 Birthday \uD83C\uDF82to You…\uD83C\uDF80\uD83C\uDF81");
        birthday.add("आसमान की बुलंदियों पर नाम हो आपका,\n" +
                "चांद की धरती पर मुकाम हो आपका…\n" +
                "हम तो रहते है छोटी-सी \uD83C\uDF0E दुनिया में,\n" +
                "पर ईश्वर करें सारा जहान हो आपका…\n" +
                "\uD83C\uDF82जन्मदिन की बहोत बहोत शुभकामनायें \uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("On these Beautiful Birthday,\n" +
                "भगवान करे आप Enjoyment से\n" +
                "भरपूर और Smile से अपना आज\n" +
                "का दिन Celebrate करो, और\n" +
                "बहुत सारी Surprises पाओ,,,\n" +
                "^\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81^HAPPY BIRTHDAY^\uD83C\uDF82^");
        birthday.add("हमारे लिये खास है आज का दिन,\n" +
                "जो नहीं बिताना चाहते आपके बिन,\n" +
                "वैसे तो हर दुआ \uD83D\uDE4Fआपके लिये मांगते है,\n" +
                "फिर भी कहते है –\n" +
                "खुब सारी खुशियाँ मिले आपको इस जन्मदिन…\n" +
                "\uD83C\uDF82जन्मदिन की बधाई हो…\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("ज़िंदगी की कुछ खास दुआएँ\uD83D\uDE4F ले लो हमसे\n" +
                "जन्मदिन पर कुछ नजराने ले लो हमसे\n" +
                "भर दे रंग जो तेरे जीवन के पलो में,\n" +
                "आज वो हसी मुबारक बाद ले लो हमसे…\uD83C\uDF80\uD83C\uDF81");
        birthday.add("सूरज की रोशनी लेकर आया,\n" +
                "और चिडियों ने गाना गाया…\n" +
                "फूलों ने हंस हंस कर बोला…\n" +
                "मुबारक हो तुम्हारा जन्मदिन आया…\n" +
                "\uD83C\uDF82*Happy Birthday*\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81\n" +
                "Good Morning Have a Blessing day…");
        birthday.add("#Life का हर #Goal रहे आपका #Clear,\n" +
                "तुम #Success पाओ Without any #Fear\n" +
                "हर पल जियो Without any #Tear,\n" +
                "Enjoy your day my #Dear,\n" +
                "\uD83C\uDF82HAPPY BIRTHDAY\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("ये दुआ \uD83D\uDE4F है आपके जन्मदिन पे हमारी,\n" +
                "ना तूटे कभी दोस्ती हमारी,\n" +
                "सारी जिंदगी देंगे खुशियाँ आपको…\n" +
                "और वो खुशियाँ होगी प्यारी प्यारी…\uD83D\uDE0A\n" +
                "\uD83C\uDF82Happy Birthday to you my Best Friend…\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("ख्वाहिशों के समंदर के सब मोती तेरे नसीब हो,\n" +
                "तेरे चाहने वाले हमसफ़र तेरे हरदम करीब हों,\n" +
                "कुछ यूँ उतरे तेरे लिए रहमतों का मौसम,\n" +
                "कि तेरी हर \uD83D\uDE4F दुआ, हर ख्वाहिश कबूल हो।\n" +
                "\uD83C\uDF82जन्मदिन की बधाई!\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("एक दुआ \uD83D\uDE4F है कोई गिला नहीं हो,\n" +
                "ऐसा प्यार \uD83D\uDC96 का फूल \uD83C\uDF3A जो आज तक खिला ना हो,\n" +
                "आज मिले वो सब आपको,\n" +
                "जो आज तक कभी किसी को मिला ना हो…\n" +
                "\uD83C\uDF82H’py B’day to u\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("खुदा कैसे करूँ शुक्रिया इस दिन के लिए\n" +
                "जिस दिन तुम्हे धरती पर भेजा हमारे लिए\n" +
                "ना जाने क्यों मैं इंतज़ार कर रहा था\n" +
                "शायद जन्मदिन है तुम्हारा इस लिए\n" +
                "मेरी हर एक दुआ \uD83D\uDE4F है तेरी लंबी उमर के लिए\n" +
                "दिल ❤️ खुद जानता है तू ना हो तो धड़केगा \uD83D\uDC97 किस के लिए\n" +
                "Happy Birthday\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("Birthday Shayari For Lover:\n" +
                "ऐ खुदा एक मन्नत है हमारी,\n" +
                "मेरी जान \uD83D\uDC9E जन्नत है हमारी,\uD83D\uDE18\n" +
                "चाहे हम हो ना हो साथ उनके,\n" +
                "पर खुशियाँ मिले उनको प्यारी❣️प्यारी…\n" +
                "Happy Birthday \uD83D\uDE18 Jaan…\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("ज़िंदगी की कुछ खास \uD83D\uDE4F दुआए लेलो हमसे\n" +
                "जन्मदिन पर कुछ नजराने ले लो हमसे\n" +
                "भर दे रंग जो तेरे जीवन के पलो में…\n" +
                "आज वो हसी मुबारक बाद ले लो हमसे\n" +
                "Happy Birthday\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("जन्मदिन के ये ख़ास लम्हें मुबारक,\n" +
                "आँखों में बसे नए ख्वाब मुबारक,\n" +
                "जिंदगी जो लेकर आई है आपके लिए आज..\n" +
                "वो तमाम खुशियों की हंसीं सौगात मुबारक!\n" +
                "Happy Birthday\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("प्यार से भरी जिंदगी मिले आपको,\n" +
                "खुशियाँ से भरे पल मिले आपको,\n" +
                "कभी किसी ग़म का सामना ना करना पड़े,\n" +
                "ऐसा आने वाला कल मिले आपको…\n" +
                "\uD83C\uDF82हेप्पी बर्थडे टू यू….\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("जन्मदिन \uD83C\uDF82 के ये ख़ास लम्हें मुबारक,\n" +
                "आँखों में बसे नए ख्वाब मुबारक,\n" +
                "जिंदगी जो लेकर आई है आपके लिए आज…\n" +
                "वो तमाम खुशियों की हंसीं सौगात मुबारक….!!!");
        birthday.add("तोहफा मैं तुझे आज मेरा दिल ❤️ ही देता हूँ,\n" +
                "ये हसीन मोका गवाना नहीं चाहता हूँ,\n" +
                "अपने दिल ❤️ की बात तुम्हारे सामने बतलाता हूँ,\n" +
                "और तुम्हारे जन्म दिन की शुभ कामनाये देता हूँ.\n" +
                "\uD83C\uDF80\uD83C\uDF81Happiest Birthday to U\uD83C\uDF80\uD83C\uDF81");
        birthday.add("हमारी एक प्यारी सी दुआ \uD83D\uDE4F है,\n" +
                "आपकी हर दुआ \uD83D\uDE4F पुरी हो,\n" +
                "जो प्यारी चाहते होती है सपनों में,\n" +
                "वो सारी चाहते आपकी पुरी हो…\n" +
                "\uD83C\uDF80\uD83C\uDF81Janmadin Mubarak!\uD83C\uDF82");
        birthday.add("जरूर तूमको किसीने दिल ❤️ से पुकारा होगा,\n" +
                "एक बार तो चाँद ने कभी तुमको निहारा होगा,\n" +
                "मायूस हुए होंगे सितारे भी उस दिन,\n" +
                "खुदाने जब जमीन पर तुमको उतारा होगा…\n" +
                "\uD83C\uDF82जन्मदिन मुबारक हो…\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("हर लम्हा आपके हाथों पे मुस्कान रहे,\n" +
                "हर ग़म से आप अन्जान रहे,\n" +
                "जिसके साथ मेहक उठे आपकी जिंदगी,\n" +
                "हमेशा आपके पास वो इंसान रहे…\n" +
                "\uD83C\uDF82 Happy Birthday To You…\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("खुद भी नाचेंगे \u200D तुमको \u200D भी नचायेंगे…\n" +
                "बड़ी धुम धाम से\n" +
                "तुम्हारा बर्थड़े बनायेंगे…\n" +
                "गिफ्ट मे मांगो अगर जान हमारी तो आपकी कसम\n" +
                "हसँ कर कुरबाँ हो जायेगें…\uD83D\uDE18\uD83D\uDC96\n" +
                "\uD83C\uDF82Haքքy WaLa Birthday\uD83C\uDF82\uD83C\uDF80\uD83C\uDF81");
        birthday.add("गुलाब की तरह खुशियाँ खिले जिवन में आपके,\n" +
                "खूश्बु की तरह हँसी बनी रहे होटों पे आपके,\n" +
                "मुस्कुराते रहो आप हमेशा यूँही –\n" +
                "और हम बने रहे दिल ❤️ में आपके…\n" +
                "Wishing u a Happy Birthday\uD83C\uDF80\uD83C\uDF81");
        birthday.add("आ तेरी उम्र में लिख दूँ, चाँद सितारों से…\n" +
                "तेरा जन्मदिन मैं मनाउ, फूलों से बहारों से…\n" +
                "हर एक खूबसुरती मैं \uD83C\uDF0E दुनियाँ से ले आऊ,\n" +
                "सझाऊ ये महेफिल में हर हसीन नजारों से… ~ Happy Birthday\uD83C\uDF82");
        System.out.println("Birthday " + birthday.size());

        mother = new ArrayList<>();
        mother.add("चलती फिरती आँखों से अज़ाँ देखी है,\n" +
                "मैंने जन्नत तो नहीं देखी है माँ देखी है।");
        mother.add("तेरे क़दमों में ये सारा जहां होगा एक दिन,\n" +
                "माँ के होठों पे तबस्सुम को सजाने वाले।");
        mother.add("किसी भी \u200Bमुश्किल का अब किसी को हल नहीं मिलता,\n" +
                "\u200Bशायद अब घर से कोई माँ के पैर छूकर नहीं निकलता\u200B।");
        mother.add("उमर भर तेरी मोहब्बत मेरी खिदमतगार रही माँ,\n" +
                "मैं तेरी खिदमत के काबिल जब हुआ तू चली गयी माँ।");
        mother.add("सबकुछ मिल जाता है दुनिया में मगर,\n" +
                "याद रखना की बस माँ-बाप नहीं मिलते,\n" +
                "मुरझा कर जो गिर गए एक बार डाली से,\n" +
                "ये ऐसे फूल हैं जो फिर नहीं खिलते।");
        mother.add("रूह के रिश्तों की ये गहराइयाँ तो देखिये,\n" +
                "चोट लगती है हमें और चिल्लाती है माँ,\n" +
                "हम खुशियों में माँ को भले ही भूल जायें,\n" +
                "जब मुसीबत आ जाए तो याद आती है माँ।");
        mother.add("सख्त राहों में भी आसान सफ़र लगता है,\n" +
                "ये मेरी माँ की दुआओं का असर लगता है।");
        mother.add("जब भी कश्ती मेरी सैलाब में आ जाती है,\n" +
                "माँ दुआ करती हुई ख्वाब में आ जाती है।");
        mother.add("वो लिखा के लायी है किस्मत में जागना,\n" +
                "माँ कैसे सो सकेगी कि बेटा सफ़र में है।");
        mother.add("जरा सी बात है लेकिन हवा को कौन समझाए,\n" +
                "कि मेरी माँ दिए से मेरे लिए काजल बनाती है।");
        mother.add("सीधा साधा भोला भाला मैं ही सब से सच्चा हूँ,\n" +
                "कितना भी हो जाऊं बड़ा माँ आज भी तेरा बच्चा हूँ।");
        mother.add("यूँ तो मैंने बुलन्दियों के हर निशान को छुआ,\n" +
                "जब माँ ने गोद में उठाया तो आसमान को छुआ।");
        mother.add("अपनी माँ को कभी न देखूँ तो चैन नहीं आता है,\n" +
                "दिल न जाने क्यूँ माँ का नाम लेते ही बहल जाता है।");
        mother.add("कभी मुस्कुरा दे तो लगता है ज़िंदगी मिल गयी मुझको,\n" +
                "माँ दुखी हो तो दिल मेरा भी दुखी हो जाता है।");
        mother.add("माँ तो जन्नत का फूल है,\n" +
                "प्यार करना उसका उसूल है,\n" +
                "दुनिया की मोहब्बत फिजूल है,\n" +
                "माँ की हर दुआ कबूल है,\n" +
                "माँ को नाराज करना इंसान तेरी भूल है,\n" +
                "माँ के कदमो की मिट्टी जन्नत की धूल है।");
        mother.add("गिन लेती है दिन बगैर मेरे गुजारें हैं कितने,\n" +
                "भला कैसे कह दूं कि माँ अनपढ़ है मेरी। ");
        mother.add("पहाड़ो जैसे सदमे झेलती है उम्र भर लेकिन,\n" +
                "बस इक औलाद की तकलीफ़ से माँ टूट जाती है।");
        mother.add("उसके होंठों पे कभी बद्दुआ नहीं होती,\n" +
                "बस एक माँ है जो कभी खफा नहीं होती।");
        mother.add("वो तो असर है मां की दुआओं में,\n" +
                "वरना इतना सुकून कहां था इन हवाओं में।");
        mother.add("मां तेरे दूध का हक़ मुझसे अदा क्या होगा,\n" +
                "तू है नाराज तो खुश मुझसे खुदा क्या होगा।");
        mother.add("सवरने की कहाँ उसे फुर्सत होती है,\n" +
                "माँ फिर भी बहुत खूबसूरत होती है।");
        mother.add("ऊपर जिसका अंत नहीं उसे आसमां कहते हैं,\n" +
                "जहां में जिसका अंत नहीं उसे माँ कहते हैं।");
        mother.add("जन्नत का हर लम्हा दीदार किया था,\n" +
                "गोद में उठाकर जब मां ने प्यार किया था।");
        mother.add("सारे जहां में नहीं मिलता बेशुमार इतना,\n" +
                "सुकून मिलता है माँ के प्यार में जितना।");
        mother.add("जन्नत का एक टुकड़ा,\n" +
                "जमीन पर भी है,\n" +
                "जो मेरी माँ के क़दमों में है।");
        mother.add("रुके तो चाँद जैसी है,\n" +
                "चले तो हवाओं जैसी है,\n" +
                "वो माँ ही है,\n" +
                "जो धुप में भी छाँव जैसी है।");
        mother.add("हालातों के आगे जब साथ ना जुबां होती है,\n" +
                "पहचान लेती है खामोशी में हर दर्द,\n" +
                "वो सिर्फ \"माँ\" होती है।");
        mother.add("तुझसे बढ़कर ना है कोई,\n" +
                "ना तुझसा कोई प्यारा,\n" +
                "माँ तू ही है खुदा हमारे लिए,\n" +
                "जिसने हमें प्यार से पाला।");
        mother.add("उसके रहते जीवन में कोई गम नहीं होता,\n" +
                "दुनिया साथ दे ना दे पर माँ का प्यार,\n" +
                "कभी कम नहीं होता।");
        mother.add("बेहद मीठा कोमल होता है,\n" +
                "माँ के प्यार से ज्यादा,\n" +
                "कुछ नहीं अनमोल होता है।");
        mother.add("वो जमीं मेरी वो ही आसमान,\n" +
                "वो खुदा मेरा वो ही भगवान्,\n" +
                "क्यों मैं जाऊं उसे कहीं छोड़,\n" +
                "माँ के क़दमों में सारा जहां हैं।");
        mother.add("माँ है मोहब्बत का नाम,\n" +
                "माँ को हजारों सलाम,\n" +
                "करदे फ़िदा जिंदगी,\n" +
                "आए जो बच्चों के काम।");
        mother.add("तेरे ही आँचल में निकला बचपन,\n" +
                "तुझ से ही तो जुड़ी हर धड़कन,\n" +
                "कहने को तो माँ सब कहते है,\n" +
                "पर मेरे लिए तो है तू भगवान्।");
        mother.add("मंजिल दूर और सफर बहुत है,\n" +
                "छोटी सी जिंदगी की फिकर बहुत है,\n" +
                "मार डालती ये दुनिया कब की हमें,\n" +
                "लेकिन \"माँ\" की दुआओं में असर बहुत है।");
        mother.add("तेरे पैरों के निचे है जन्नत मेरी,\n" +
                "उम्र भर सर पे साया तेरा चाहिए,\n" +
                "प्यारी माँ मुझको तेरी दुआ चाहिए,\n" +
                "तेरे आँचल की ठंडी हवा चाहिए।");
        mother.add("माँ अपने बच्चों पर सब न्योंछावर करती है,\n" +
                "बिना लालच उन्हें प्यार करती है,\n" +
                "भगवान् का दूसरा रूप है मेरी माँ,\n" +
                "जो हर दुःख में मेरा साथ देती है।");
        System.out.println("Mother " + mother.size());

        father = new ArrayList<>();
        father.add("मुझे मोहब्बत है अपने हाथों की सब लकीरों से,\n" +
                "ना जाने पापा ने कौनसी ऊँगली को पकड़कर चलना सिखाया था।");
        father.add("नसीब वाले हैं जिनके सर पर पिता का हाथ होता हैं,\n" +
                "ज़िद पूरी हो जाती हैं सब गर पिता का साथ होता हैं।");
        father.add("मुझे रख दिया छाँव में खुद जलते रहे धूप में,\n" +
                "मैंने देखा है ऐसा एक फरिश्ता अपने पिता के रूप में।");
        father.add("जो चाहूँ वो मिल जाए मुमकिन नहीं,\n" +
                "ये किस्मत है मेरे पापा का घर नहीं।");
        father.add("बेमतलब सी इस दुनिया में वो ही हमारी शान है,\n" +
                "किसी शख्स के वजूद की ‘पिता’ ही पहली पहचान है।");
        father.add("आपके ही नाम से जाना जाता हूँ “पापा”,\n" +
                "भला इस से बड़ी शोहरत मेरे लिए क्या होगी।");
        father.add("खुशिया जहाँ की सारी मिल जाती है,\n" +
                "जब पापा की गोद में झपकी मिल जाती है।");
        father.add("कंधो पर झुलाया कंधो पर घुमाया,\n" +
                "एक पापा की बदौलत ही मेरा जीवन खुबसूरत बन पाया।");
        father.add("खुशियों से भरा हर पल होता हैं\n" +
                "जिन्दगी में सुनहरा हर कल होता हैं\n" +
                "मिलती हैं कामयाबी उन को\n" +
                "जिनके सर पर पिता का हाथ होता हैं।");
        father.add("प्यारे पापा के प्यार भरे\n" +
                "सीने से जो लग जाते हैं\n" +
                "सच कहती हूँ विश्वास करो\n" +
                "जीवन में सदा सुख पाते हैं।");
        father.add("पिता के बिना ज़िन्दगी वीरान होती हैं\n" +
                "तन्हा सफ़र में हर राह सुनसान होती हैं\n" +
                "ज़िन्दगी में पिता का होना जरूरी हैं\n" +
                "पिता के साथ से हर राह आसान होती हैं।");
        father.add("वो जमीं मेरा वो ही आसमान हैं\n" +
                "वो खुदा मेरा वो ही भगवान है\n" +
                "क्यों मैं जाऊं कही उसे छोड़ के\n" +
                "पापा के क़दमों में मेरा सारा जहान हैं");
        father.add("मेरा साहस मेरा सम्मान है पिता\n" +
                "मेरी ताकत मेरी पहचान है पिता\n" +
                "शायद रब ने भेजा फल ये अच्छे कर्मों का\n" +
                "उसकी रहमत उसका है वरदान पिता");
        father.add("क्या कहूँ उस पिता के बारे में\n" +
                "जिसने सोचा नहीं कभी खुद के बारे में\n" +
                "पापा आपने मुझे जिंदगी भर दिया है\n" +
                "आपका तहे दिल से बेहद शुक्रिया हैं");
        father.add("फुल कभी दोबारा नहीं खिलते\n" +
                "जन्म कभी दोबारा नहीं मिलते\n" +
                "मिलते है लोग हजारों दुनिया में\n" +
                "पर पापा जितने प्यारे नहीं मिलते");
        father.add("कभी हँसी और ख़ुशी का मेला है पिता\n" +
                "कभी कितना अकेला और तन्हा है पिता\n" +
                "माँ तो कह देती है अपने दिल की बात\n" +
                "सब कुछ समेट के आसमान सा फैला है पिता");
        father.add("हैँ समाज का नियम भी ऐसा पिता सदा गम्भीर रहे,\n" +
                "मन मे भाव छुपे हो लाखोँ, आँखो से न नीर बहे!\n" +
                "करे बात भी रुखी-सूखी, बोले बस बोल हिदायत के,\n" +
                "दिल मे प्यार है माँ जैसा ही, किंतु अलग तस्वीर रहे!");
        father.add("तन्हाई में जब बीते लम्हो की याद आती हैं,\n" +
                "क्या कहे जिस्म से जान चली जाती हैं,\n" +
                "यूँ तो पापा बहुत दूर चले गए हम से\n" +
                "पर आँखे बंद करे तो सूरत उनकी नजर आती हैं");
        father.add("मंजिल दूर और सफ़र बहुत है,\n" +
                "छोटी सी जिन्दगी की फिकर बहुत है,\n" +
                "मार डालती ये दुनिया कब की हमे,\n" +
                "लेकिन “पापा ” के प्यार में असर बहुत है !");
        father.add("अज़ीज़ भी वो है, नसीब भी वो है ,\n" +
                "दुनिया की भीड़ में करीब भी वो है\n" +
                "उनकी दुआ से चलती है ज़िन्दगी\n" +
                "क्यों की खुदा भी वो है ,\n" +
                "और तक़दीर भी वो है ..!!");
        father.add("हँसते हैं हंसाते हैं मेरे पापा,\n" +
                "मेरे लिये खुशिया लाते हॆ मेरे पापा.\n" +
                "जब मे रुठ जाती हूँ,\n" +
                "तो मनाते हे मेरे प्यारे पापा.\n" +
                "गुडिया हु मे पापा की,\n" +
                "ओर मेरे सब से प्यारे दोस्त हॆ पापा");
        father.add("मेरे होठों की हँसी मेरे पापा की बदोलत है,\n" +
                "मेरी आँखों में खुशी मेरे पापा की बदोलत है ,\n" +
                "पापा किसी खुदा से कम नही\n" +
                "क्योकि मेरी ज़िन्दगी की सारी खुशी पापा की बदोलत है.");
        System.out.println("Father " + father.size());


        new_year = new ArrayList<>();
        new_year.add("बीते साल को विदा इस कदर करते हैं,\n" +
                "ज़ो नहीं किया अब तक वो भी कर गुज़रते हैं,\n" +
                "नया साल आने की खुशियाँ तो सब मनाते हैं,\n" +
                "चलो हम, इस बार बीते साल की यादो का जश्न मनाते हैं!!");
        new_year.add("कभी हसती है तो कभी रूलाती है\n" +
                "ये जिंन्दगी भी न जाने कितने रंग दिखाती है।\n" +
                "हसते हैं तो भी आंखों में नमी आ जाती है\n" +
                "ना जाने ये कैसी यादें है जो दिल में बस जाती है\n" +
                "दुआ करते हैं इन नये साल के अवसर पर\n" +
                "मेरे दोस्तो के लवों पर सदा मुस्कान रहे\n" +
                "क्योंकि उन की हर मुस्कुराहट हमे खुशी दे जाती है.");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        new_year.add("");
        System.out.println("New Year " + new_year.size());

        intezaar = new ArrayList<>();
        intezaar.add("ऐ मौत उन्हें भुलाए ज़माने गुजर गए,\n" +
                "आ जा कि ज़हर खाए ज़माने गुजर गए,\n" +
                "ओ जाने वाले आ कि तेरे इंतजार में,\n" +
                "रास्ते को घर बनाए ज़माने गुजर गए।");
        intezaar.add("दिन भर भटकते रहते हैं अरमान तुझसे मिलने के,\n" +
                "न ये दिल ठहरता है न तेरा इंतज़ार रुकता है।");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        intezaar.add("");
        System.out.println("Intezaar " + intezaar.size());


        ArrayList<String> shayariList = null;
        if (topic.equals("legend")) {
            shayariList = legend;
            shayariImage.setImageResource(R.drawable.legend);
        } else if (topic.equals("alone")) {
            shayariList = alone;
            shayariImage.setImageResource(R.drawable.alone);
        } else if (topic.equals("attitude")) {
            shayariList = attitude;
            shayariImage.setImageResource(R.drawable.attitude);
        } else if (topic.equals("love")) {
            shayariList = love;
            shayariImage.setImageResource(R.drawable.love);
        } else if (topic.equals("dosti")) {
            shayariList = dosti;
            shayariImage.setImageResource(R.drawable.dosti);
        } else if (topic.equals("zindagi")) {
            shayariList = zindagi;
            shayariImage.setImageResource(R.drawable.zindagi);
        } else if (topic.equals("funny")) {
            shayariList = funny;
            shayariImage.setImageResource(R.drawable.funny);
        } else if (topic.equals("bewafa")) {
            shayariList = bewafa;
            shayariImage.setImageResource(R.drawable.bewafa);
        } else if (topic.equals("sad")) {
            shayariList = sad;
            shayariImage.setImageResource(R.drawable.sad);
        } else if (topic.equals("judai")) {
            shayariList = judai;
            shayariImage.setImageResource(R.drawable.judai);
        } else if (topic.equals("dard")) {
            shayariList = dard;
            shayariImage.setImageResource(R.drawable.dard);
        } else if (topic.equals("good_morning")) {
            shayariList = good_morning;
            shayariImage.setImageResource(R.drawable.good_morning);
        } else if (topic.equals("good_night")) {
            shayariList = good_night;
            shayariImage.setImageResource(R.drawable.good_night);
        } else if (topic.equals("birthday")) {
            shayariList = birthday;
            shayariImage.setImageResource(R.drawable.birthday);
        } else if (topic.equals("mother")) {
            shayariList = mother;
            shayariImage.setImageResource(R.drawable.mother);
        } else if (topic.equals("father")) {
            shayariList = father;
            shayariImage.setImageResource(R.drawable.father);
        } else if (topic.equals("new_year")) {
            shayariList = new_year;
            shayariImage.setImageResource(R.drawable.new_year);
        } else if (topic.equals("intezaar")) {
            shayariList = intezaar;
            shayariImage.setImageResource(R.drawable.intezaar);
        }

        final int[] index = {0};
        shayariText.setText(shayariList.get(index[0]));
        curShayari = shayariList.get(index[0]);
        curIndex = index[0];
        uniqueText = topic + "_" + curIndex;

        if (mAuth.getCurrentUser() != null) {
            String uid = mAuth.getCurrentUser().getUid();
            mRef = mDatabase.getReference().child(uid).child("favourite_shayari").child(uniqueText);

            mRef.addValueEventListener(new ValueEventListener() {
                @Override
                public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                    if (dataSnapshot.exists()) {
                        isCurShayariFav = true;
                        int imgResource = R.drawable.ic_favorite_24;
                        favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                        favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                        favButton.setText("Remove Fav");
                    }
                }

                @Override
                public void onCancelled(@NonNull DatabaseError databaseError) {

                }
            });
        }
        final ArrayList<String> finalShayariList = shayariList;
        nextButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                nextButtonFunction();
                shayariImage.startAnimation(rightAnim);
                //shayariText.startAnimation(rightAnim);
                index[0]++;
                if (index[0] > finalShayariList.size() - 1) {
                    index[0] = 0;
                }
                shayariText.setText(finalShayariList.get(index[0]));
                curShayari = finalShayariList.get(index[0]);
                curIndex = index[0];
                uniqueText = topic + "_" + curIndex;

                if (mAuth.getCurrentUser() != null) {
                    String uid = mAuth.getCurrentUser().getUid();
                    mRef = mDatabase.getReference().child(uid).child("favourite_shayari").child(uniqueText);

                    mRef.addValueEventListener(new ValueEventListener() {
                        @Override
                        public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                            if (dataSnapshot.exists()) {
                                isCurShayariFav = true;
                                int imgResource = R.drawable.ic_favorite_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Remove fav");
                            } else {
                                isCurShayariFav = false;
                                int imgResource = R.drawable.ic_favorite_border_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Add to fav");
                            }
                        }

                        @Override
                        public void onCancelled(@NonNull DatabaseError databaseError) {

                        }
                    });
                }
            }
        });
        prevButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                shayariImage.startAnimation(leftAnim);
                //shayariText.startAnimation(leftAnim);
                index[0]--;
                if (index[0] < 0) {
                    index[0] = finalShayariList.size() - 1;
                }
                shayariText.setText(finalShayariList.get(index[0]));
                curShayari = finalShayariList.get(index[0]);
                curIndex = index[0];
                uniqueText = topic + "_" + curIndex;

                if (mAuth.getCurrentUser() != null) {
                    String uid = mAuth.getCurrentUser().getUid();
                    mRef = mDatabase.getReference().child(uid).child("favourite_shayari").child(uniqueText);

                    mRef.addValueEventListener(new ValueEventListener() {
                        @Override
                        public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                            if (dataSnapshot.exists()) {
                                isCurShayariFav = true;
                                int imgResource = R.drawable.ic_favorite_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Remove fav");
                            } else {
                                isCurShayariFav = false;
                                int imgResource = R.drawable.ic_favorite_border_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Add to fav");
                            }
                        }

                        @Override
                        public void onCancelled(@NonNull DatabaseError databaseError) {

                        }
                    });
                }
            }
        });

        relativeLayout.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                goToEditActivity();
            }
        });
        shayariImage.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                goToEditActivity();
            }
        });

        shayariImage.setOnTouchListener(new OnSwipeTouchListener(TopicShayariActivity.this) {

            public void onSwipeTop() {
                //Toast.makeText(TopicShayariActivity.this, "top", Toast.LENGTH_SHORT).show();
            }

            public void onSwipeRight() {
                //prev
                shayariImage.startAnimation(leftAnim);
                shayariText.startAnimation(leftAnim);
                index[0]--;
                if (index[0] < 0) {
                    index[0] = finalShayariList.size() - 1;
                }
                shayariText.setText(finalShayariList.get(index[0]));
                curShayari = finalShayariList.get(index[0]);
                curIndex = index[0];
                uniqueText = topic + "_" + curIndex;

                if (mAuth.getCurrentUser() != null) {
                    String uid = mAuth.getCurrentUser().getUid();
                    mRef = mDatabase.getReference().child(uid).child("favourite_shayari").child(uniqueText);

                    mRef.addValueEventListener(new ValueEventListener() {
                        @Override
                        public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                            if (dataSnapshot.exists()) {
                                isCurShayariFav = true;
                                int imgResource = R.drawable.ic_favorite_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Remove fav");
                            } else {
                                isCurShayariFav = false;
                                int imgResource = R.drawable.ic_favorite_border_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Add to fav");
                            }
                        }

                        @Override
                        public void onCancelled(@NonNull DatabaseError databaseError) {

                        }
                    });
                }
            }

            public void onSwipeLeft() {
                //next
                shayariImage.startAnimation(rightAnim);
                shayariText.startAnimation(rightAnim);
                index[0]++;
                if (index[0] > finalShayariList.size() - 1) {
                    index[0] = 0;
                }
                shayariText.setText(finalShayariList.get(index[0]));
                curShayari = finalShayariList.get(index[0]);
                curIndex = index[0];
                uniqueText = topic + "_" + curIndex;

                if (mAuth.getCurrentUser() != null) {
                    String uid = mAuth.getCurrentUser().getUid();
                    mRef = mDatabase.getReference().child(uid).child("favourite_shayari").child(uniqueText);

                    mRef.addValueEventListener(new ValueEventListener() {
                        @Override
                        public void onDataChange(@NonNull DataSnapshot dataSnapshot) {
                            if (dataSnapshot.exists()) {
                                isCurShayariFav = true;
                                int imgResource = R.drawable.ic_favorite_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Remove fav");
                            } else {
                                isCurShayariFav = false;
                                int imgResource = R.drawable.ic_favorite_border_24;
                                favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                favButton.setText("Add to fav");
                            }
                        }

                        @Override
                        public void onCancelled(@NonNull DatabaseError databaseError) {

                        }
                    });
                }
            }

            public void onSwipeBottom() {
                //Toast.makeText(TopicShayariActivity.this, "bottom", Toast.LENGTH_SHORT).show();
            }

        });
        favButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                mProgress.show();

                if (mAuth.getCurrentUser() == null) {
                    mProgress.dismiss();
                    AlertDialog.Builder builder = new AlertDialog.Builder(TopicShayariActivity.this,R.style.AlertDialogTheme);
                    builder.setTitle("To add shayari to favorite you need login to the app!");
                    builder.setPositiveButton("Login", new DialogInterface.OnClickListener() {
                        @Override
                        public void onClick(DialogInterface dialog, int which) {
                            startActivity(new Intent(TopicShayariActivity.this,LoginActivity.class));
                            finish();
                        }
                    });
                    builder.setNegativeButton("Cancel", null);
                    builder.setCancelable(false);
                    AlertDialog dialog = builder.create();
                    dialog.show();

                    Toast.makeText(TopicShayariActivity.this, "Please login to add shayari to favourites!", Toast.LENGTH_SHORT).show();
                } else {
                    String uid = mAuth.getCurrentUser().getUid();
                    mRef = mDatabase.getReference().child(uid).child("favourite_shayari");

                    if (isCurShayariFav) {
                        mRef.child(uniqueText).removeValue().addOnCompleteListener(new OnCompleteListener<Void>() {
                            @Override
                            public void onComplete(@NonNull Task<Void> task) {
                                mProgress.dismiss();
                                if (task.isSuccessful()){
                                    Toast.makeText(TopicShayariActivity.this, "Shayari removed from Favourite!", Toast.LENGTH_SHORT).show();
                                    isCurShayariFav=false;
                                    int imgResource = R.drawable.ic_favorite_border_24;
                                    favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                    favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                    favButton.setText("Add to fav");
                                }else{
                                    Toast.makeText(TopicShayariActivity.this, task.getException().getLocalizedMessage(), Toast.LENGTH_SHORT).show();
                                }
                            }
                        });
                    }else{

                        HashMap<String, String> map = new HashMap<>();
                        map.put("topic", topic);
                        map.put("shayari", curShayari);
                        mRef = mRef.child(uniqueText);
                        mRef.setValue(map).addOnCompleteListener(new OnCompleteListener<Void>() {
                            @Override
                            public void onComplete(@NonNull Task<Void> task) {
                                mProgress.dismiss();
                                if (task.isSuccessful()) {
                                    Toast.makeText(TopicShayariActivity.this, "Shayari added to favourite!", Toast.LENGTH_SHORT).show();
                                    isCurShayariFav=true;
                                    int imgResource = R.drawable.ic_favorite_24;
                                    favButton.setCompoundDrawablesWithIntrinsicBounds(imgResource, 0, 0, 0);
                                    favButton.setCompoundDrawableTintList(getColorStateList(R.color.button_text_color));
                                    favButton.setText("Remove fav");
                                } else {
                                    Toast.makeText(TopicShayariActivity.this, task.getException().getLocalizedMessage(), Toast.LENGTH_SHORT).show();
                                }
                            }
                        });
                    }
                }
            }
        });
        moreButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                goToEditActivity();
            }
        });
        copyButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                ClipboardManager clipboard = (ClipboardManager) getSystemService(Context.CLIPBOARD_SERVICE);
                ClipData clip = ClipData.newPlainText("Shayari", curShayari);
                clipboard.setPrimaryClip(clip);
                Toast.makeText(TopicShayariActivity.this, "Copied to clipboard", Toast.LENGTH_SHORT).show();
            }
        });

        whatsAppShareButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                v = view;
                //watermark.setVisibility(View.VISIBLE);

                if (checkPermission()) {
                    Bitmap bitmap = Bitmap.createBitmap(relativeLayout.getWidth(), relativeLayout.getHeight(),
                            Bitmap.Config.ARGB_8888);
                    Canvas canvas = new Canvas(bitmap);
                    relativeLayout.draw(canvas);

                    Bitmap icon = bitmap;
                    Intent share = new Intent(Intent.ACTION_SEND);
                    share.setType("image/png");
                    share.setPackage("com.whatsapp");

                    ContentValues values = new ContentValues();
                    values.put(MediaStore.Images.Media.DATE_TAKEN, System.currentTimeMillis());
                    values.put(MediaStore.Images.Media.TITLE, "Your Shayari");
                    values.put(MediaStore.Images.Media.MIME_TYPE, "image/png");
                    //MediaStore.Images.Media.insertImage(getContentResolver(), icon, topic+" shayari", "yourDescription");
                    Uri uri = getContentResolver().insert(MediaStore.Images.Media.EXTERNAL_CONTENT_URI,
                            values);


                    OutputStream outstream;
                    try {
                        outstream = getContentResolver().openOutputStream(uri);
                        icon.compress(Bitmap.CompressFormat.PNG, 100, outstream);
                        outstream.close();
                    } catch (Exception e) {
                        System.err.println(e.toString());
                        Toast.makeText(TopicShayariActivity.this, e.toString(), Toast.LENGTH_SHORT).show();
                    }

                    share.putExtra(Intent.EXTRA_STREAM, uri);
                    try {
                        startActivity(share);
                    } catch (android.content.ActivityNotFoundException ex) {
                        Toast.makeText(TopicShayariActivity.this, "WhatsApp have not been installed.", Toast.LENGTH_SHORT).show();
                    }

                } else {
                    requestPermission();
                }


                //watermark.setVisibility(View.GONE);

            }
        });
        shareButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                v = view;
                if (checkPermission()) {
                    share();

                } else {
                    requestPermission();
                }
            }
        });

    }

    private void nextButtonFunction() {
    }

    private void prevButtonFunction() {
    }

    private boolean checkPermission() {
        int result = ContextCompat.checkSelfPermission(getApplicationContext(), WRITE_EXTERNAL_STORAGE);
        //int result1 = ContextCompat.checkSelfPermission(getApplicationContext(), CAMERA);

        return result == PackageManager.PERMISSION_GRANTED /*&& result1 == PackageManager.PERMISSION_GRANTED */;
    }

    private void requestPermission() {

        ActivityCompat.requestPermissions(this, new String[]{WRITE_EXTERNAL_STORAGE}, PERMISSION_REQUEST_CODE);

    }

    @Override
    public void onRequestPermissionsResult(int requestCode, String permissions[], int[] grantResults) {
        switch (requestCode) {
            case PERMISSION_REQUEST_CODE:
                if (grantResults.length > 0) {

                    boolean storageAccepted = grantResults[0] == PackageManager.PERMISSION_GRANTED;
                    //boolean cameraAccepted = grantResults[1] == PackageManager.PERMISSION_GRANTED;

                    if (storageAccepted /*&& cameraAccepted*/)
                        Snackbar.make(v, "Permission Granted, Now you can access internal storage.", Snackbar.LENGTH_LONG).show();
                    else {

                        Snackbar.make(v, "Permission Denied, You cannot access internal storage.", Snackbar.LENGTH_LONG).show();

                        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.M) {
                            if (shouldShowRequestPermissionRationale(WRITE_EXTERNAL_STORAGE)) {
                                showMessageOKCancel("You need to allow access to storage permissions",
                                        new DialogInterface.OnClickListener() {
                                            @Override
                                            public void onClick(DialogInterface dialog, int which) {
                                                if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.M) {
                                                    requestPermissions(new String[]{WRITE_EXTERNAL_STORAGE},
                                                            PERMISSION_REQUEST_CODE);
                                                }
                                            }
                                        });
                                return;
                            }
                        }

                    }
                }


                break;
        }
    }

    private void showMessageOKCancel(String message, DialogInterface.OnClickListener okListener) {
        new AlertDialog.Builder(TopicShayariActivity.this)
                .setMessage(message)
                .setPositiveButton("OK", okListener)
                .setNegativeButton("Cancel", null)
                .create()
                .show();
    }

    private void share() {
        Bitmap bitmap = Bitmap.createBitmap(relativeLayout.getWidth(), relativeLayout.getHeight(),
                Bitmap.Config.ARGB_8888);
        Canvas canvas = new Canvas(bitmap);
        relativeLayout.draw(canvas);

        Bitmap icon = bitmap;
        Intent share = new Intent(Intent.ACTION_SEND);
        share.setType("image/png");

        ContentValues values = new ContentValues();
        values.put(MediaStore.Images.Media.DATE_TAKEN, System.currentTimeMillis());
        values.put(MediaStore.Images.Media.TITLE, "Your Shayari");
        values.put(MediaStore.Images.Media.MIME_TYPE, "image/png");
        //MediaStore.Images.Media.insertImage(getContentResolver(), icon, topic+" shayari", "yourDescription");
        Uri uri = getContentResolver().insert(MediaStore.Images.Media.EXTERNAL_CONTENT_URI,
                values);


        OutputStream outstream;
        try {
            outstream = getContentResolver().openOutputStream(uri);
            icon.compress(Bitmap.CompressFormat.PNG, 100, outstream);
            outstream.close();
        } catch (Exception e) {
            System.err.println(e.toString());
        }

        share.putExtra(Intent.EXTRA_STREAM, uri);
        startActivity(Intent.createChooser(share, "Share Image using:"));

    }

    @Override
    public boolean onSupportNavigateUp() {
        onBackPressed();
        return true;
    }

    public void goToEditActivity() {
        Intent intent = new Intent(TopicShayariActivity.this, EditActivity.class);
        intent.putExtra("cur_shayari", curShayari);
        intent.putExtra("topic", topic);
        startActivity(intent);
        //Toast.makeText(TopicShayariActivity.this, "Jald aa raha :-)", Toast.LENGTH_SHORT).show();
    }
}